// pages/demo05/demo05.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    //班组单选框
    shiftTeam: [
      { id: '1', value: 'A' },
      { id: '2', value: 'B' }
    ],
    //更换理由下拉选择框内容
    reasons:['漏水严重','撞枪蹭件','寿命到期','螺纹损坏','粘枪拉弯','电极帽频繁脱落',],
    //当前选中数组的下标值
    customIndex: [0, 0, 0, 0],
    //当前选中数组
    onlyArray: [
      [],
      [],
      [],
      []
    ],
    //customArray假设为我们从后台获取到的json数据
    customArray: [
      {
        name: '',
        dept: [
          {
            name: '',
            product: [{ name: '', num: [{ name: '' }, ] }, ]
          },
        ]
      },
      //2.1总拼
      {
        name: '2.1总拼',
        dept: [
          //总拼1
          {
            name: '总拼1',
            product: [
              { name: '5230R01', num: [{ name: '1974-12' },{ name: '354631' },  { name: '1974-1' } ] }, 
              { name: '5230R02', num: [{ name: '1974-12' },{ name: '354631' },  { name: '1974-1' } ] }, 
              { name: '5230R03', num: [{ name: '378236' }, { name: '401783' }, ] }, 
              { name: '5230R04', num: [{ name: '378236' }, { name: '401783' }, ] }, 
              { name: '5230R05', num: [{ name: '378160' }, { name: '1974-9' },  { name: '1974-1' },{ name: 'H-25' }] }, 
              { name: '5230R06', num: [{ name: '378160' }, { name: '1974-9' },  { name: '1974-1' },{ name: 'H-25' }] }, 
              { name: '5230R07', num: [{ name: '1974-12' },{ name: '1974-9' },  { name: '1974-1' }] }, 
              { name: '5230R08', num: [{ name: '1973-4' }, { name: '1973-7' },  { name: '1973-1' }] }, 
              { name: '5230R09', num: [{ name: '360063' }, { name: '1974-12' }, { name: '1974-1' }] }, 
              { name: '5250R01', num: [{ name: '389247' }, { name: '389248' }, ] }, 
              { name: '5250R02', num: [{ name: '378167' }, { name: '1974-13' }, { name: '1974-1' }] }, 
              { name: '5250R03', num: [{ name: '360063' }, { name: '1974-12' }, { name: '1974-1' }] }, 
              { name: '5250R04', num: [{ name: '401767' }, { name: '1974-12' }, { name: '1974-1' }] }, 
              { name: '5250R05', num: [{ name: '372008' }, { name: '1974-12' }, { name: '1974-1' }] }, 
              { name: '5250R06', num: [{ name: '347819' }, { name: '1973-8' },  { name: '1973-1' }] }, 
              { name: '5260R01', num: [{ name: '401787' }, { name: '1974-13' }, { name: '324918-6' },{ name: '1974-1'}] }, 
              { name: '5260R02', num: [{ name: '378167' }, { name: '401787' },  { name: 'H-22' }] }, 
              { name: '5260R04', num: [{ name: '372008' }, { name: '1974-12' }, { name: '1974-1' }] }, 
              { name: '5260R05', num: [{ name: '347819' }, { name: '1973-8' },  { name: '1973-1' }] }, 
              { name: '5270R01', num: [{ name: '401767' }, { name: '1974-12' }, { name: '1974-1' }] }, 
              { name: '5270R02', num: [{ name: '389247' }, { name: '389248' }, ] }, 
              { name: '5270R03', num: [{ name: '378167' }, { name: '1974-13' }, { name: 'H-22' },{ name: '1974-1'}] }, 
              { name: '5270R04', num: [{ name: '378223' }, { name: '1974-13' }, { name: '1974-1' }] }, 
            ]
          },
          //总拼2
          {
            name: '总拼2',
            product: [
              { name: '5330R01', num: [{ name: '378197' }, { name: '378198' }, ] }, 
              { name: '5330R02', num: [{ name: '378197' }, { name: '378198' }, ] }, 
              { name: '5330R03', num: [{ name: '401779' }, { name: '401780' }, ] }, 
              { name: '5330R04', num: [{ name: '401779' }, { name: '401780' }, ] }, 
              { name: '5330R05', num: [{ name: '378197' }, { name: '378198' }, ] }, 
              { name: '5330R06', num: [{ name: '378197' }, { name: '378198' }, ] }, 
              { name: '5330R07', num: [{ name: '1974-12' },{ name: '1974-9' }, { name: '1974-1' }, ] }, 
              { name: '5330R08', num: [{ name: '378167' }, { name: '1974-13' },{ name: 'H-22' },{ name: '1974-1'},]}, 
              { name: '5330R09', num: [{ name: '358860' }, { name: '378204' }, ] }, 
              { name: '5340R01', num: [{ name: '360063' }, { name: '1974-12' },{ name: '1974-1' },] }, 
              { name: '5340R02', num: [{ name: '360063' }, { name: '1974-12' },{ name: '1974-1' },] }, 
              { name: '5340R03', num: [{ name: '380306' }, { name: '1974-12' },{ name: 'H-23' },{ name: '1974-1' }, ] }, 
              { name: '5340R04', num: [{ name: '380306' }, { name: '1974-12' },{ name: 'H-23' },{ name: '1974-1' }, ] }, 
              { name: '5370R01', num: [{ name: '360063' }, { name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: '5370R02', num: [{ name: '1973-7' }, { name: '1974-13' },{ name: '1974-1' },{ name: '1973-1' },{ name: '333612'},]}, 
              { name: '5370R05', num: [{ name: '378223' }, { name: '1974-13' },{ name: '1974-1' }, ] }, 
              { name: '5370R06', num: [{ name: '378230' }, { name: '1974-13' },{ name: '1974-1' }, ] }, 
            ]
          },
          //总拼3
          {
            name: '总拼3',
            product: [
              { name: '5440R02', num: [{ name: '367369' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: '5440R03', num: [{ name: '367369' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: '5480R01', num: [{ name: '367369' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: '5480R02', num: [{ name: '367369' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: '5480R03', num: [{ name: '380380' },{ name: '1974-13' },{ name: '1974-1' },{ name: 'H-22' }, ] }, 
              { name: '5480R04', num: [{ name: '380380' },{ name: '1974-13' },{ name: '1974-1' },{ name: 'H-22' }, ] }, 
              { name: '5480R05', num: [{ name: '389212' },{ name: '1974-10' },{ name: '1974-1' }, ] }, 
              { name: '5480R06', num: [{ name: '397824' },{ name: '1974-11' },{ name: '1974-1' }, ] }, 
            ]
          },
          //总拼4
          {
            name: '总拼4',
            product: [
              { name: '5510R01', num: [{ name: '1974-10' },{ name: '389351' }, { name: '1974-1' }, ] }, 
              { name: '5510R02', num: [{ name: '380306' }, { name: '1974-13' },{ name: 'H-23' },{ name: '1974-1' },  ] }, 
              { name: '5510R03', num: [{ name: '395847' }, { name: '344431' }, { name: 'H-23' },   ] }, 
              { name: '5510R04', num: [{ name: '395847' }, { name: '344431' }, { name: 'H-23' },   ] }, 
              { name: '5520R01', num: [{ name: '380306' }, { name: '1974-13' },{ name: 'H-23' },{ name: '1974-1' },   ] }, 
              { name: '5520R02', num: [{ name: '1974-10' },{ name: '389351' }, { name: '1974-1' }, ] }, 
              { name: '5520R03', num: [{ name: '393123' }, { name: '401771' }, { name: 'H-23' },   ] }, 
              { name: '5520R04', num: [{ name: '360063' }, { name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: '5520R05', num: [{ name: '395847' }, { name: '344431' }, { name: 'H-23' },   ] }, 
              { name: '5520R06', num: [{ name: '395847' }, { name: '344431' }, { name: 'H-23' },   ] }, 
              { name: '5530R01', num: [{ name: '389286' }, { name: '1974-13' },{ name: '1974-1' }, ] }, 
              { name: '5530R02', num: [{ name: '389286' }, { name: '1974-13' },{ name: '1974-1' }, ] }, 
              { name: '5530R03', num: [{ name: '1973-7' }, { name: '1974-13' },{ name: '1974-1' },{ name: '1973-1' }, ] }, 
              { name: '5530R04', num: [{ name: '393123' }, { name: '401771' }, { name: 'H-23' },   ] }, 
              { name: '5530R05', num: [{ name: '378229' }, { name: '378230' },  ] }, 
              { name: '5530R06', num: [{ name: '378229' }, { name: '378230' },  ] }, 
              { name: '5550R02', num: [{ name: '389286' }, { name: '1974-13' }, { name: '1974-1' }, ] }, 
              { name: '5550R03', num: [{ name: '360063' }, { name: '1974-12' }, { name: '1974-1' }, ] }, 
              { name: '5550R05', num: [{ name: '380306' }, { name: '1974-13' }, { name: 'H-23' },{ name: '1974-1' }, ] }, 
              { name: '5550R06', num: [{ name: '360063' }, { name: '1974-12' }, { name: '1974-1' }, ] }, 
            ] 
          }
        ]
      },
     //2.1底板分拼
     {
      name: '2.1底板分拼',
      dept: [
          //纵梁
        {
          name: '纵梁',
          product: [
            { name: '1000R01SK1', num: [{ name: '11891' }, { name: '11921' },  { name: '1973-8' }, { name: 'H-22' },  { name: '1973-1' },] }, 
            { name: '1010R01SK1', num: [{ name: '11891' }, { name: '11921' },  { name: '1973-8' }, { name: 'H-22' },  { name: '1973-1' },] }, 
            { name: '1010R01SK1', num: [{ name: '10108' }, { name: '17693' },  { name: '12616' },  { name: '1973-8' },{ name: '1973-1' },] }, 
            { name: '1020R01SK1', num: [{ name: '17694' }, { name: '11376' },  { name: 'H-22' }, ] }, 
            { name: '1030R01SK1', num: [{ name: '17694' }, { name: '11376' },  { name: 'H-22' }, ] }, 
            { name: '1040R01SK1', num: [{ name: '17694' }, { name: '11376' },  { name: 'H-22' }, ] }, 
            { name: '1050R01SK1', num: [{ name: '15643' }, { name: '11421' },  { name: '15644' }, { name: '1974-1' },{ name: '1974-11' },] }, 
            { name: '1060R01SK1', num: [{ name: '389254' },{ name: '389255' }, { name: 'H-21' }, ] }, 
            { name: '1070R01SK1', num: [{ name: '389263' },{ name: '389264' }, { name: 'H-21' }, ] }, 
            { name: '1080R01SK1', num: [{ name: '389298' },{ name: '389297' }, { name: 'H-25' }, ] }, 
            { name: '1090R01SK1', num: [{ name: '389298' },{ name: '389297' }, { name: 'H-25' }, ] }, 
            { name: '1100R01SK1', num: [{ name: '389263' },{ name: '389264' }, { name: 'H-21' }, ] }, 
            { name: '1110R01SK1', num: [{ name: '389263' },{ name: '389264' }, { name: 'H-21' }, ] }, 
            { name: '1120R01SK1', num: [{ name: '389263' },{ name: '389264' }, { name: 'H-21' }, ] }, 
            { name: '1130R01SK1', num: [{ name: '389257' },{ name: '389258' }, ] }, 
            { name: '1130R02SK1', num: [{ name: '389263' },{ name: '389264' }, { name: 'H-21' }, ] }, 
            { name: '1140R01SK1', num: [{ name: '389251' },{ name: '1974-1' }, { name: '1974-9' }, ] }, 
            { name: '1140R02SK1', num: [{ name: '389297' },{ name: '389298' }, { name: 'H-25' }, ] }, 
            { name: '1150R01SK1', num: [{ name: '389251' },{ name: '1974-1' }, { name: '1974-9' }, ] }, 
            { name: '1150R02SK1', num: [{ name: '389297' },{ name: '389298' }, { name: 'H-25' }, ] }, 
            { name: '1160R01SK1', num: [{ name: '389266' },{ name: '1974-1' }, { name: '1974-12' }, ] }, 
            { name: '1170R01SK1', num: [{ name: '389266' },{ name: '1974-1' }, { name: '1974-12' }, ] }, 
            { name: '1180R01SK1', num: [{ name: '1974-1' },{ name: '1974-12' },{ name: '389266' }, ] }, 
            { name: '1190R01SK1', num: [{ name: '1974-1' },{ name: '1974-12' },{ name: '389266' }, ] }, 
            { name: '1200R01SK1', num: [{ name: '389298' },{ name: '389297' }, { name: 'H-25' }, ] }, 
            { name: '1210R01SK1', num: [{ name: '389298' },{ name: '389297' }, { name: 'H-25' }, ] }, 
            { name: '1220R01SK1', num: [{ name: '1974-1' },{ name: '1974-12' },{ name: '389266' }, ] }, 
            { name: '1230R01SK1', num: [{ name: '1974-1' },{ name: '1974-12' },{ name: '389266' }, ] }, 
            { name: '1240R01SK1', num: [{ name: '389298' },{ name: '389297' }, { name: 'H-25' }, ] }, 
            { name: '1250R01SK1', num: [{ name: '389298' },{ name: '389297' }, { name: 'H-25' }, ] }, 
          ]
        },
          //水箱
          {
            name: '水箱',
            product: [
              { name: '2450R01SK1', num: [{ name: 'H-22' },   { name: '17692' },  { name: '1973-7' }, ] }, 
              { name: '2450R01SK2', num: [{ name: 'H-22' },   { name: '17692' },  { name: '1973-7' }, ] }, 
              { name: '2460R01SK1', num: [{ name: '1974-1' }, { name: 'H-24' },   { name: '17691' },  { name: '1974-11' },] }, 
              { name: '2460R01SK2', num: [{ name: '1974-1' }, { name: 'H-24' },   { name: '17691' },  { name: '1974-11' },] }, 
              { name: '2465R01SK1', num: [{ name: '1973-5' }, { name: '1973-7' }, { name: '1973-1' }, ] }, 
              { name: '2465R01SK2', num: [{ name: '1973-8' }, { name: '1973-1' }, { name: '17691' },  ] }, 
              { name: '2470R01SK1', num: [{ name: '13164' },  { name: 'H-22' },   { name: '15991' },  ] }, 
              { name: '2480R01SK1', num: [{ name: '14736' },  { name: '1973-3' },      ] }, 
              { name: '2530R01SK1', num: [{ name: '378130' }, { name: '1974-9' }, { name: 'H-24' },   { name: '1974-1' },] }, 
              { name: '2560R01SK1', num: [{ name: '389238' }, { name: 'H-24' },   { name: '389239' },] }, 
              { name: '2580R01SK1', num: [{ name: '341403' }, { name: '342324' },     ] }, 
              { name: '2590R01SK1', num: [{ name: '1974-13' },{ name: '342541' }, { name: 'H-24' },   { name: '1974-1' },] }, 
              { name: '2600R01SK1', num: [{ name: '1974-12' },{ name: '374889' }, { name: '1974-1' }, ] }, 
              { name: '2610R01SK1', num: [{ name: '389238' }, { name: '389239' }, { name: 'H-24' },   ] }, 
              { name: '2630R01SK1', num: [{ name: '1973-7' }, { name: '1973-1' },        ] }, 
              { name: '2650R01SK1', num: [{ name: '389238' }, { name: '389239' }, { name: 'H-24' },   ] }, 
              { name: '2660R01SK1', num: [{ name: '389238' }, { name: '389239' }, { name: 'H-24' },   ] }, 
              { name: '2670R01SK1', num: [{ name: '389238' }, { name: '389239' }, { name: 'H-24' },   ] }, 
              { name: '2700R01SK1', num: [{ name: '1974-13' },{ name: '380380' }, { name: '1974-1' }, ] }, 
              { name: '2710R01SK1', num: [{ name: '347819' }, { name: 'H-23' },   { name: '1974-11' },{ name: '1974-1' },] }, 
              { name: '2730R01SK1', num: [{ name: '389294' }, { name: '1974-10' },{ name: '1974-1' }, ] }, 
              { name: '2730R02SK1', num: [{ name: '380380' }, { name: '1974-13' },{ name: '1974-1' }, ] }, 
              { name: '2750R01SK1', num: [{ name: '1974-1' }, { name: '376523' }, { name: '1974-12' },] }, 
            ]
          },
          //前底板
          {
            name: '前底板',
            product: [
              { name: '1300R01SK1', num: [{ name: '389225' },  { name: '1973-5' }, { name: 'H-22' },{ name: '1973-1' },] }, 
              { name: '1305R01SK1', num: [{ name: '389225' },  { name: '1973-5' }, { name: 'H-22' },{ name: '1973-1' },] }, 
              { name: '1310R01SK1', num: [{ name: '389225' },  { name: '1973-5' }, { name: 'H-22' },{ name: '1973-1' },] }, 
              { name: '1328R01SK1', num: [{ name: '318130' },  { name: '1974-1' }, { name: '1974-12' },] }, 
              { name: '1330R01SK1', num: [{ name: '1973-7' },  { name: '1974-1' }, { name: '1974-13' },{ name: '1973-1' },] }, 
              { name: '1332R01SK1', num: [{ name: '389225' },  { name: '1973-5' }, { name: 'H-22' },   { name: '1973-1' },] }, 
              { name: '1338R01SK1', num: [{ name: '318130' },  { name: '1974-1' }, { name: '1974-12' },] }, 
              { name: '1342R01SK1', num: [{ name: '1974-1' },  { name: '1974-12' },{ name: '378130' },] }, 
              { name: '1380R01SK1', num: [{ name: '389235' },  { name: '1974-1' }, { name: '1974-12' },] }, 
              { name: '1380R02SK1', num: [{ name: '389235' },  { name: '1974-1' }, { name: '1974-12' },] }, 
              { name: '1380R03SK1', num: [{ name: '1974-1' },  { name: '1974-12' },{ name: '1974-9' },] }, 
              { name: '1380R04SK1', num: [{ name: '1974-1' },  { name: '1974-12' },{ name: '1974-9' },] }, 
              { name: '1390R01SK1', num: [{ name: '1974-1' },  { name: '1974-12' },{ name: '1974-9' },] }, 
              { name: '1400R01SK1', num: [{ name: '1974-1' },  { name: '1974-12' },{ name: '1974-9' },] }, 
              { name: '1410R01SK1', num: [{ name: '389227' },  { name: '1974-1' }, { name: '1974-13' },] }, 
              { name: '1415R01SK1', num: [{ name: '1974-1' },  { name: '1974-11' },{ name: '347819' },] }, 
              { name: '1430R01SK1', num: [{ name: '1974-1' },  { name: '1974-13' },{ name: '389230' },] }, 
              { name: '1430R02SK1', num: [{ name: '389230' },  { name: '1974-1' }, { name: '1974-13' },] }, 
              { name: '1430R03SK1', num: [{ name: '389269' },  { name: '1974-1' }, { name: '1974-12' },] }, 
              { name: '1430R04SK1', num: [{ name: '389269' },  { name: '1974-1' }, { name: '1974-12' },] }, 
              { name: '1435R01SK1', num: [{ name: '389230' },  { name: '1974-1' }, { name: '1974-13' },] }, 
              { name: '1445R01SK1', num: [{ name: '374889' },  { name: '1974-1' }, { name: '1974-12' },] }, 
              { name: '1445R02SK1', num: [{ name: '1974-12' }, { name: '389227' }, { name: '1974-1' },] }, 
              { name: '1452R01SK1', num: [{ name: '389269' },  { name: '1974-1' }, { name: '1974-12' },] }, 
              { name: '1452R01SK1', num: [{ name: '374889' },  { name: '1974-1' }, { name: '1974-12' },] }, 
              { name: '1460R01SK1', num: [{ name: '1974-1' },  { name: '1974-12' },{ name: '380236' },] }, 
              { name: '1470R01SK1', num: [{ name: '389269' },  { name: '1974-1' }, { name: '1974-12' },] }, 
              { name: '1470R02SK1', num: [{ name: '1974-1' },  { name: '1974-12' },{ name: '1974-9' },] }, 
              { name: '1470R03SK1', num: [{ name: '1974-1' },  { name: '1974-12' },{ name: '1974-9' },] }, 
              { name: '1470R04SK1', num: [{ name: '1973-8' },  { name: '347819' }, { name: '1973-1' },] }, 
              { name: '1480R01SK1', num: [{ name: '1974-1' },  { name: '1974-13' },{ name: '376523' },] }, 
            ]
          },
          //后底板
          {
            name: '后底板',
            product: [
              { name: '1770R01SK1', num: [{ name: '389235' }, { name: '1974-1' }, { name: '1974-12' }, ] }, 
              { name: '1770R02SK1', num: [{ name: '389235' }, { name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: '1830R01SK1', num: [{ name: '367369' }, { name: '1974-1' }, { name: '1974-11' }, ] }, 
              { name: '1830R02SK1', num: [{ name: '367369' }, { name: '1974-1' }, { name: '1974-11' }, ] }, 
              { name: '1840R01SK1', num: [{ name: '367369' }, { name: '1974-1' }, { name: '1974-11' }, ] }, 
              { name: '1850R01SK1', num: [{ name: '1974-12' },{ name: '389271' }, { name: '1974-1' }, ] }, 
              { name: '1850R02SK1', num: [{ name: '389233' }, { name: '1974-1' }, { name: '1974-13' }, ] }, 
              { name: '1850R03SK1', num: [{ name: '389233' }, { name: '1974-1' }, { name: '1974-11' }, ] }, 
              { name: '1860R01SK1', num: [{ name: '374889' }, { name: '1974-1' }, { name: '1974-12' }, ] }, 
              { name: '1875R01SK1', num: [{ name: '389307' }, { name: '1973-5' }, ] }, 
              { name: '1880R01SK1', num: [{ name: '374889' }, { name: '1974-1' }, { name: '1974-12' }, ] }, 
              { name: '1885R01SK1', num: [{ name: '374889' }, { name: '1974-1' }, { name: '1974-12' }, ] }, 
              { name: '1895R01SK1', num: [{ name: '389235' }, { name: '1974-1' }, { name: '1974-12' }, ] }, 
              { name: '1900R01SK1', num: [{ name: '389235' }, { name: '1974-1' }, { name: '1974-12' }, ] }, 
              { name: '1910R01SK1', num: [{ name: '1974-1' }, { name: '1974-12' },] }, 
              { name: '1910R02SK1', num: [{ name: '1974-1' }, { name: '1974-12' },] }, 
              { name: '1920R01SK1', num: [{ name: '374889' }, { name: '1974-1' }, { name: '1974-12' }, ] }, 
              { name: '1920R01SK2', num: [{ name: '380313' }, { name: '384593' }, ] }, 
              { name: '1920R01SK3', num: [{ name: '1974-1' }, { name: '1974-11' },{ name: '389260' }, ] }, 
              { name: '1925R01SK1', num: [{ name: '374889' }, { name: '1974-1' }, { name: '1974-12' }, ] }, 
              { name: '1925R01SK2', num: [{ name: '389260' }, { name: '1974-11' },{ name: '1974-1' }, ] }, 
              { name: '1925R01SK3', num: [{ name: '380313' }, { name: '384593' }, ] }, 
              { name: '1940R01SK1', num: [{ name: '359870' }, { name: '1974-9' }, { name: '1974-1' }, ] }, 
              { name: '1940R01SK2', num: [{ name: '1974-12' },{ name: '376523' }, { name: '1974-1' }, ] }, 
              { name: '1940R01SK3', num: [{ name: '1974-1' }, { name: '1974-12' }, ] }, 
              { name: '1950R01SK1', num: [{ name: '1974-1' }, { name: '1974-12' },] }, 
            ]
          },]},
      //2.1底板主线
     {
        name: '2.1底板主线',
        dept: [
          //GEO1
          {
            name: 'GEO1',
            product: [
              { name: '2000R01SK1', num: [{ name: '1976-9' },{ name: '1976-1' }, { name: '1974-9' },{ name: '1974-1' }, ] }, 
              { name: '2000R02SK1', num: [{ name: '1976-9' },{ name: '1976-1' }, { name: '1974-9' },{ name: '1974-1' }, ] }, 
              { name: '2000R03SK1', num: [{ name: '389303' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: '2000R04SK1', num: [{ name: '389303' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: '2000R05SK1', num: [{ name: '389303' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: '2000R06SK1', num: [{ name: '389303' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
            ]
          },
          //GEO2
          {
            name: 'GEO2',
            product: [
              { name: '3020R01SK1', num: [{ name: '348463' },  { name: '1974-13' },{ name: '1974-1' },] }, 
              { name: '3020R02SK1', num: [{ name: '348463' },  { name: '1974-13' },{ name: '1974-1' },] }, 
              { name: '3020R03SK1', num: [{ name: '376523' },  { name: '1974-12' },{ name: '1974-1' },] }, 
              { name: '3020R04SK1', num: [{ name: '376523' },  { name: '1974-12' },{ name: '1974-1' },] }, 
              { name: '3020R05SK1', num: [{ name: '363103' },  { name: '1974-12' },{ name: '1974-1' },] }, 
              { name: '3020R06SK1', num: [{ name: '363103' },  { name: '1974-12' },{ name: '1974-1' },] }, 
              { name: '3070R01SK1', num: [{ name: '381354' },  ] }, 
              { name: '3070R02SK1', num: [{ name: '381354' },  ] }, 
              { name: '3070R03SK1', num: [{ name: '374887' },  { name: '1974-12' },{ name: '1974-1' },] }, 
              { name: '3070R04SK1', num: [{ name: '347819' },  { name: '1974-11' },{ name: '1974-1' },{ name: '324918-3'},] }, 
              { name: '3070R05SK1', num: [{ name: '1974-12' }, { name: '1974-1' }, { name: '378130' },] }, 
              { name: '3070R06SK1', num: [{ name: '1974-12' }, { name: '1974-1' }, { name: '378130' },] }, 
            ]
          },
          //UB1.1
          {
            name: 'UB1.1',
            product: [
              { name: '2030R01SK1', num: [{ name: '1974-9' }, { name: '1974-1' }, { name: '1974-12' },] }, 
              { name: '2030R02SK1', num: [{ name: '1974-9' }, { name: '1974-1' }, { name: '1974-12' },] }, 
              { name: '2030R03SK1', num: [{ name: '389149' }, { name: 'H-25' },   { name: '1974-11' },{ name: '1974-1' },] }, 
              { name: '2030R04SK1', num: [{ name: '389149' }, { name: 'H-25' },   { name: '1974-11' },{ name: '1974-1' },] }, 
              { name: '2040R01SK1', num: [{ name: '378130' }, { name: '1974-12' },{ name: '1974-1' },] }, 
              { name: '2040R02SK1', num: [{ name: '347819' }, { name: '1074-11' },{ name: '1974-1' },] }, 
              { name: '2050R01SK1', num: [{ name: '401759' }, { name: '1974-1' }, { name: '1974-12' },] }, 
              { name: '2050R02SK1', num: [{ name: '401759' }, { name: '1974-1' }, { name: '1974-12' },] }, 
              { name: '2080R01SK1', num: [{ name: 'H-22' },   { name: '17694' },  { name: '11376' },] }, 
              { name: '2080R01SK2', num: [{ name: 'H-22' },   { name: '17694' },  { name: '11376' },] }, 
            ]
          },
          //UB1.2
          {
            name: 'UB1.2',
            product: [
              { name: '2110R01SK1', num: [{ name: '344431' },  { name: 'H-23' },   { name: '401756' },] }, 
              { name: '2110R02SK1', num: [{ name: '344431' },  { name: 'H-23' },   { name: '401756' },] }, 
              { name: '2120R01SK1', num: [{ name: '378130' },  { name: '1974-12' },{ name: '1974-1' },] }, 
              { name: '2120R02SK1', num: [{ name: '378130' },  { name: '1974-12' },{ name: '1974-1' },] }, 
              { name: '2120R03SK1', num: [{ name: '378130' },  { name: '1974-12' },{ name: '1974-1' },] }, 
              { name: '2120R04SK1', num: [{ name: '378130' },  { name: '1974-12' },{ name: '1974-1' },] }, 
              { name: '2130R01SK1', num: [{ name: '401759' },  { name: '1974-12' },{ name: '1974-1' },] }, 
              { name: '2130R02SK1', num: [{ name: '401759' },  { name: '1974-12' },{ name: '1974-1' },] }, 
              { name: '2160R01SK1', num: [{ name: '1974-12' }, { name: '1974-9' }, { name: '1974-1' },] }, 
              { name: '2160R02SK1', num: [{ name: '1974-12' }, { name: '1974-9' }, { name: '1974-1' },] }, 
              { name: '2160R03SK1', num: [{ name: '1974-13' }, { name: '1974-1' }, { name: '389230' },] }, 
              { name: '2160R04SK1', num: [{ name: '1973-7' },  { name: '1974-9' }, { name: '1973-1' },{ name: '1974-1' },{ name: '324918-5' },] }, 
            ]
          },
          //UB2.1
          {
            name: 'UB2.1',
            product: [
              { name: '3110R01SK1', num: [{ name: '376523' },{ name: '1974-12' }, { name: '1974-1' },] }, 
              { name: '3110R02SK1', num: [{ name: '376523' },{ name: '1974-12' }, { name: '1974-1' },] }, 
              { name: '3110R03SK1', num: [{ name: '359870' },{ name: '1973-7' },  { name: '1973-1' },{ name: 'H-23' },] }, 
              { name: '3110R04SK1', num: [{ name: '359870' },{ name: '1973-7' },  { name: '1973-1' },{ name: 'H-23' },] }, 
              { name: '3120R01SK1', num: [{ name: '378150' },{ name: '359087' },  { name: 'H-22' },] }, 
              { name: '3120R02SK1', num: [{ name: '374889' },{ name: '1974-12' }, { name: '1974-1' },] }, 
              { name: '3120R03SK1', num: [{ name: '389214' },{ name: '1974-11' }, { name: '1974-1' },{ name: '324918-3' },] }, 
              { name: '3120R04SK1', num: [{ name: '389214' },{ name: '1974-11' }, { name: '1974-1' },{ name: '324918-3' },] }, 
              { name: '3160R01SK1', num: [{ name: '389269' },{ name: '393225' },  ] }, 
              { name: '3160R02SK1', num: [{ name: '389269' },{ name: '393225' },  ] }, 
            ]
          },
          //UB2.2
          {
            name: 'UB2.2',
            product: [
              { name: '3210R01SK1', num: [{ name: '378183' },{ name: '1974-11' },{ name: '1974-1' },   { name: '' },] }, 
              { name: '3210R02SK1', num: [{ name: '378183' },{ name: '1974-11' },{ name: '1974-1' },   { name: '' },] }, 
              { name: '3210R03SK1', num: [{ name: '360063' },{ name: '1974-12' },{ name: '1974-1' },   { name: '324918-6' },] }, 
              { name: '3210R04SK1', num: [{ name: '360063' },{ name: '1974-12' },{ name: '1974-1' },   { name: '324918-6' },] }, 
              { name: '3220R01SK1', num: [{ name: '401762' },{ name: '1974-10' },{ name: '1974-1' },   { name: '314918-5' },] }, 
              { name: '3220R02SK1', num: [{ name: '381735' },{ name: '1974-10' },{ name: '1974-1' },   { name: '314918-5' },] }, 
              { name: '3220R03SK1', num: [{ name: '374889' },{ name: '1974-12' },{ name: '324918-2' }, { name: '1974-1' },] }, 
              { name: '3220R04SK1', num: [{ name: '374889' },{ name: '1974-12' },{ name: '324918-2' }, { name: '1974-1' },] }, 
              { name: '3230R01SK1', num: [{ name: '380236' },{ name: '1974-12' },{ name: '1974-1' },   { name: '324918-1' },] }, 
              { name: '3230R02SK1', num: [{ name: '380236' },{ name: '1974-12' },{ name: '1974-1' },   { name: '324918-1' },] }, 
              { name: '3230R03SK1', num: [{ name: '389301' },{ name: '1973-2' },  ] }, 
              { name: '3230R04SK1', num: [{ name: '389301' },{ name: '1973-2' },  ] }, 
            ]
          },
        ]
      },
      //2.1侧围
      {
        name: '2.1侧围',
        dept: [
          {
            //SIHL
            name: 'SIHL',
            product: [
              { name: '3330R01SK1', num: [{ name: '344431' }, { name: '389284' }, { name: 'H-23' }, ] }, 
              { name: '3335R01SK1', num: [{ name: '395825' }, { name: '378206' }, { name: 'H-23' }, ] }, 
              { name: '3350R01SK1', num: [{ name: '378177' }, { name: '401791' }, { name: '1974-10' },{ name: '1974-9' },{ name: '1974-1' }, ] }, 
              { name: '3371R01SK1', num: [{ name: '395849' }, { name: '1974-10' },{ name: '1974-13' },{ name: '1974-1' }, ] }, 
              { name: '3375R01SK1', num: [{ name: '1974-10' },{ name: '1974-13' },{ name: '1974-1' }, { name: '358873' },{ name: '324918-8' },] }, 
              { name: '3390R01SK1', num: [{ name: '401773' }, { name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: '3410R01SK1', num: [{ name: '344431' }, { name: '389284' }, { name: 'H-23' }, ] }, 
              { name: '3430R01SK1', num: [{ name: '378243' }, { name: '1974-10' },{ name: '1974-1' }, { name: 'H-24' },] }, 
            ]
          },
          {
            //SIHR
            name: 'SIHR',
            product: [
              { name: '3320R01SK1', num: [{ name: '344431' }, { name: '389284' }, { name: '378130' }, { name: '1974-12' },{ name: '1974-1' }, { name: 'H-23' }, ] }, 
              { name: '3325R01SK1', num: [{ name: '378206' }, { name: '395852' }, { name: 'H-23' },   ] }, 
              { name: '3340R01SK1', num: [{ name: '378177' }, { name: '401791' }, { name: '1974-10' },{ name: '1974-13' },{ name: '1974-9' },{ name: '1974-1' },] }, 
              { name: '3361R01SK1', num: [{ name: '395849' }, { name: '1974-10' },{ name: '1974-13' },{ name: '1974-1' },] }, 
              { name: '3365R01SK1', num: [{ name: '1974-10' },{ name: '1974-13' },{ name: '1974-1' }, { name: '358873' },{ name: '324918-8' },] }, 
              { name: '3380R01SK1', num: [{ name: '401773' }, { name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: '3400R01SK1', num: [{ name: '389284' }, { name: '344431' }, { name: 'H-23' }, ] }, 
              { name: '3420R01SK1', num: [{ name: '378243' }, { name: '1974-10' },{ name: '1974-1' }, { name: 'H-24' },] }, 
            ]
          },
            //STIL
            {
              name: 'STIL',
              product: [
                { name: '3550R01SK1', num: [{ name: '378177' },{ name: '1974-10' },{ name: '1974-1' },{ name: '324918-5' },  ] },
                { name: '3550R02SK1', num: [{ name: '378165' },{ name: 'H-21' },   { name: '378164' }, ] },
                { name: '3550R03SK1', num: [{ name: '381737' },{ name: '1974-10' },{ name: '1974-1' }, { name: '324918-5' }, ] },
                { name: '3570R01SK1', num: [{ name: '378165' },{ name: 'H-21' },   { name: '378164' }, ] },
                { name: '3650R01SK1', num: [{ name: '378243' },{ name: '1974-10' },{ name: 'H-24' }, { name: '1974-1' }, ] },
                { name: '3650R02SK1', num: [{ name: '1973-7' },{ name: '1973-1' }, ] },
                { name: '3650R03SK1', num: [{ name: '378243' },{ name: '1974-10' },{ name: 'H-24' }, { name: '1974-1' }, ] },
                { name: '3670R01SK1', num: [{ name: '378183' },{ name: '1974-11' },{ name: '1974-1' }, ] },
                { name: '3715R01SK1', num: [{ name: '344431' },{ name: '389284' }, { name: 'H-23' }, ] },
                { name: '3715R01SK2', num: [{ name: '344431' },{ name: '389284' }, { name: 'H-23' }, ] },
               ]
            }, 
            //STIR
            {
              name: 'STIR',
              product: [
                { name: '3540R01SK1', num: [{ name: '378177' },{ name: '1974-10' },{ name: '1974-1' },{ name: '324918-5' }, ] }, 
                { name: '3540R02SK1', num: [{ name: '378165' },{ name: 'H-21' },   { name: '378164' }, ] }, 
                { name: '3540R03SK1', num: [{ name: '381735' },{ name: '1974-10' },{ name: '1974-1' },{ name: '324918-5' }, ] }, 
                { name: '3560R01SK1', num: [{ name: '378165' },{ name: 'H-21' },   { name: '378164' }, ] }, 
                { name: '3640R01SK1', num: [{ name: '378243' },{ name: '1974-10' },{ name: 'H-24' },{ name: '1974-1' }, ] }, 
                { name: '3640R02SK1', num: [{ name: '1973-7' },{ name: '1973-1' },  ] }, 
                { name: '3640R03SK1', num: [{ name: '378243' },{ name: '1974-10' },{ name: 'H-24' },{ name: '1974-1' }, ] }, 
                { name: '3660R01SK1', num: [{ name: '378183' },{ name: '1974-11' },{ name: '1974-1' }, ] }, 
                { name: '3705R01SK1', num: [{ name: '344431' },{ name: '389284' }, { name: 'H-23' }, ] }, 
                { name: '3705R01SK2', num: [{ name: '344431' },{ name: '389284' }, { name: 'H-23' }, ] }, 
              ]
            },
            //STAL
            {
              name: 'STAL',
              product: [
                { name: '4250R01SK1', num: [{ name: '389214' },  { name: '1974-11' },{ name: '1974-1' }, { name: '324918-3' }, ] }, 
                { name: '4250R01SK2', num: [{ name: '378177' },  { name: '1974-10' },{ name: '1974-1' }, { name: '324918-5' }, ] }, 
                { name: '4310R01SK1', num: [{ name: '359870' },  { name: '1974-9' }, { name: '1974-1' }, { name: 'H-23' }, ] }, 
                { name: '4310R02SK1', num: [{ name: '324918-7' },{ name: '389118' }, { name: '1974-12' },{ name: '1974-1' }, ] }, 
                { name: '4330R01SK1', num: [{ name: '378243' },  { name: '1974-10' },{ name: '1974-1' },  ] }, 
                { name: '4330R02SK1', num: [{ name: '389235' },  { name: '1974-12' },{ name: '1974-1' },  ] }, 
                { name: '4350R02SK1', num: [{ name: '401769' },  { name: '395838' },  ] }, 
                { name: '4370R01SK1', num: [{ name: '1973-7' },  { name: '1973-1' },  ] }, 
              ]
            },
            //STAR
            {
              name: 'STAR',
              product: [
                { name: '4240R01SK1', num: [{ name: '378177' }, { name: '1974-10' },{ name: '1974-1' }, { name: '324918-5' },] }, 
                { name: '4240R01SK2', num: [{ name: '389214' }, { name: '1974-11' },{ name: '1974-1' }, { name: '324918-3' },] }, 
                { name: '4300R01SK1', num: [{ name: '359870' }, { name: '1974-9' }, { name: '1974-1' }, { name: 'H-23' },] }, 
                { name: '4300R02SK1', num: [{ name: '324918-7'},{ name: '389118' }, { name: '1974-12' },{ name: '1974-1' },] }, 
                { name: '4320R01SK1', num: [{ name: '378243' }, { name: '1974-10' },{ name: '1974-1' }, { name: 'H-24' },] }, 
                { name: '4320R01SK2', num: [{ name: '378243' }, { name: '1974-10' },{ name: '1974-1' }, { name: 'H-24' },] }, 
                { name: '4320R02SK1', num: [{ name: '389235' }, { name: '1974-12' },{ name: '1974-1' }, ] }, 
                { name: '4340R02SK1', num: [{ name: '401769' }, { name: '395838' }, ] }, 
                { name: '4360R01SK1', num: [{ name: '1973-7' }, { name: '1973-1' }, ] }, 
              ]
            },
            //BMPVSTA
            {
              name: 'BMPVSTA',
              product: [
                { name: '4455R01SK1', num: [{ name: '389303' },] }, 
                { name: '4455R02SK1', num: [{ name: '389303' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
                { name: '4458R01SK1', num: [{ name: '378243' },{ name: '1974-10' },{ name: 'H-24' }, ] }, 
                { name: '4475R01SK1', num: [{ name: '1974-9' },{ name: '359870' }, { name: 'H-23' }, { name: '1974-1' },] }, 
                { name: '4478R01SK1', num: [{ name: '1974-9' },{ name: '359870' }, { name: 'H-23' }, { name: '1974-1' },] }, 
              ]
            },
        ]
      },
      //2.1门盖
      {
        name: '2.1门盖',
        dept: [
          //前盖
          {
            name: '前盖',
            product: [
              { name: '7020R01SK1', num: [{ name: '378167' }, { name: '1974-13' },{ name: '1974-1' }, { name: '324918-6' },{ name: 'H-22' },] }, 
              { name: '7020R02SK1', num: [{ name: '378167' }, { name: '1974-13' },{ name: '1974-1' }, { name: '324918-6' },{ name: 'H-22' },] }, 
              { name: '7025R01SK1', num: [{ name: '378167' }, { name: '1974-13' },{ name: '1974-1' }, { name: '324918-6' },{ name: 'H-22' },] }, 
              { name: '7030R01SK1', num: [{ name: '389233' }, { name: 'H-24' },   { name: '1974-13' },{ name: '1974-1' },  { name: '324918-6' },] }, 
              { name: '7110R01SK1', num: [{ name: '1974-11' },{ name: '1974-1' }, ] }, 
              { name: '7510',       num: [{ name: '10977' },  { name: '10313' },  { name: '1974-11' },{ name: '1974-1' },  { name: '381174' },{ name: '393109' },] }, 
            ]
          },
          //后盖
          {
            name: '后盖',
            product: [
              { name: '7230R01SK1', num: [{ name: '378167' }, { name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' },{ name: 'H-22' },] }, 
              { name: '7230R02SK1', num: [{ name: '378167' }, { name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' },{ name: 'H-22' },] }, 
              { name: '7240R01SK1', num: [{ name: '378167' }, { name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' },{ name: 'H-22' },] }, 
              { name: '7250R01SK1', num: [{ name: '378167' }, { name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' },{ name: 'H-22' },] }, 
              { name: '7250R01SK2', num: [{ name: '378167' }, { name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' },{ name: 'H-22' },] }, 
              { name: '7270R01SK1', num: [{ name: '389243' }, { name: '378206' },{ name: 'H-23' },] }, 
              { name: '7280R01SK1', num: [{ name: '395840' }, { name: '395838' },] }, 
              { name: '7280R01SK2', num: [{ name: '389275' }, { name: '389276' },] }, 
              { name: '7280R02SK1', num: [{ name: '389276' }, { name: '389277' },] }, 
              { name: '7280R02SK2', num: [{ name: '395838' }, { name: '395840' },] }, 
              { name: '7290R01SK1', num: [{ name: '389281' }, { name: '389282' },] }, 
              { name: '7290R01SK2', num: [{ name: '395840' }, { name: '395838' },] }, 
              { name: '7310R01SK1', num: [{ name: '395840' }, { name: '395838' },] }, 
              { name: '7340R01SK1', num: [{ name: '1974-11' },{ name: '1974-1' }, ] }, 
              { name: '7350R01SK1', num: [{ name: '1973-7' }, { name: '1973-1' },{ name: '1974-13' },{ name: '1974-1' },] }, 
              { name: '7350R01SK2', num: [{ name: '389243' }, { name: '378206' },{ name: 'H-23' }, ] }, 
              { name: '7360R01SK1', num: [{ name: '1973-7' }, { name: '1973-1' },{ name: '1974-13' },{ name: '1974-1' },] }, 
              { name: '7360R01SK2', num: [{ name: '1973-7' }, { name: '1973-1' },{ name: '389291' }, { name: 'H-22' },{ name: '324918-12' },] }, 
            ]
          },
          //BMPV后盖
          {
            name: 'BMPV后盖',
            product: [
              { name: 'X240R01SK1', num: [{ name: '401777' }, { name: '401776' }, ] }, 
              { name: 'X240R01SK2', num: [{ name: '401777' }, { name: '401776' }, ] }, 
              { name: 'X290R01SK1', num: [{ name: '393111' }, { name: '389239' },{ name: 'H-24' }, ] }, 
              { name: 'X290R01SK2', num: [{ name: '393111' }, { name: '389239' },{ name: 'H-24' }, ] }, 
              { name: 'X310R01SK1', num: [{ name: '1974-12' },{ name: '1974-9' },{ name: '1974-1' }, ] }, 
              { name: 'X350R01SK1', num: [{ name: '1974-11' },{ name: '1974-1' }, ] }, 
              { name: 'X350R02SK1', num: [{ name: '389233' }, { name: 'H-24' },  { name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: 'X360R01SK1', num: [{ name: '389233' }, { name: 'H-24' },  { name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' }, ] }, 
            ]
          },
          //左前门
          {
            name: '左前门',
            product: [
              { name: '6050R01SK1', num: [{ name: '378160' },{ name: 'H-25' },   { name: '1974-9' }, { name: '1974-1' },{ name: '324918-7' },] }, 
              { name: '6050R02SK1', num: [{ name: '378160' },{ name: 'H-25' },   { name: '1974-9' }, { name: '1974-1' },{ name: '324918-14' },] }, 
              { name: '6070R01SK1', num: [{ name: '347819' },{ name: '1974-11' },{ name: '1974-1' }, { name: '324918-3' },] }, 
              { name: '6090R01SK1', num: [{ name: '378160' },{ name: 'H-25' },   { name: '1974-9' }, { name: '1974-1' },{ name: '324918-7' },] }, 
              { name: '6090R02SK1', num: [{ name: '389291' },{ name: '1973-7' }, { name: '1973-1' }, { name: 'H-22' },,{ name: '324918-12' }] }, 
              { name: '6110R01SK1', num: [{ name: '393097' },{ name: '374964' }, { name: 'H-20' },   { name: '324918-8' },] }, 
              { name: '6130R01SK1', num: [{ name: '1973-7' },{ name: '1973-1' }, { name: '1974-13' },{ name: '1974-1' },] }, 
              { name: '6130R01SK2', num: [{ name: '389291' },{ name: '1973-7' }, { name: '1973-1' }, { name: 'H-22' },,{ name: '324918-12' }] }, 
              { name: '6150R01SK1', num: [{ name: '378160' },{ name: 'H-25' },   { name: '1974-9' }, { name: '1974-1' },{ name: '324918-7' },] }, 
              { name: '6150R01SK2', num: [{ name: '389288' },{ name: '1974-9' }, { name: '1974-1' },] }, 
              { name: '6150R02SK1', num: [{ name: '389273' },{ name: '1974-10' },{ name: '1974-1' }, { name: '324918-7' },] }, 
              { name: '6170R01SK1', num: [{ name: '378160' },{ name: 'H-25' },   { name: '1974-9' }, { name: '1974-1' },{ name: '324918-7' },] }, 
              { name: '6170R01SK2', num: [{ name: '389291' },{ name: '1973-7' }, { name: '1973-1' }, { name: 'H-22' },,{ name: '324918-12' }] }, 
              { name: '6315R01SK1', num: [{ name: '1973-7' },{ name: '351512' }, { name: '1973-1' },] }, 
            ]
          },
          //右前门
          {
            name: '右前门',
            product: [
              { name: '6040R01SK1', num: [{ name: '378160' },{ name: 'H-25' },   { name: '1974-9' }, { name: '1974-1' },{ name: '324918-7' },] }, 
              { name: '6040R02SK1', num: [{ name: '378160' },{ name: 'H-25' },   { name: '1974-9' }, { name: '1974-1' },{ name: '324918-14' },] }, 
              { name: '6060R01SK1', num: [{ name: '347819' },{ name: '1974-11' },{ name: '1974-1' }, { name: '324918-3' },] }, 
              { name: '6080R01SK1', num: [{ name: '378160' },{ name: 'H-25' },   { name: '1974-9' }, { name: '1974-1' },{ name: '324918-7' },] }, 
              { name: '6080R02SK1', num: [{ name: '389291' },{ name: '1973-7' }, { name: '1973-1' }, { name: 'H-22' },,{ name: '324918-12' }] }, 
              { name: '6100R01SK1', num: [{ name: '393097' },{ name: '374964' }, { name: 'H-20' },   { name: '324918-8' },] }, 
              { name: '6120R01SK1', num: [{ name: '1973-7' },{ name: '1973-1' }, { name: '1974-13' },{ name: '1974-1' },] }, 
              { name: '6120R01SK2', num: [{ name: '389291' },{ name: '1973-7' }, { name: '1973-1' }, { name: 'H-22' },,{ name: '324918-12' }] }, 
              { name: '6120R02SK1', num: [{ name: '389291' },{ name: '1973-7' }, { name: '1973-1' }, { name: 'H-22' },,{ name: '324918-12' }] }, 
              { name: '6140R01SK1', num: [{ name: '389288' },{ name: '1974-9' }, { name: '1974-1' }, ] }, 
              { name: '6140R01SK2', num: [{ name: '378160' },{ name: 'H-25' },   { name: '1974-9' }, { name: '1974-1' },{ name: '324918-7' },] }, 
              { name: '6140R02SK1', num: [{ name: '389273' },{ name: '1974-10' },{ name: '1974-1' }, { name: '324918-7' },] }, 
              { name: '6160R01SK1', num: [{ name: '378160' },{ name: 'H-25' },   { name: '1974-9' }, { name: '1974-1' },{ name: '324918-7' },] }, 
              { name: '6160R01SK2', num: [{ name: '389291' },{ name: '1973-7' }, { name: '1973-1' }, { name: 'H-22' },,{ name: '324918-12' }] }, 
              { name: '6305R01SK1', num: [{ name: '1973-7' },{ name: '351512' }, { name: '1973-1' }, ] }, 
            ]
          },
          //左后门
          {
            name: '左后门',
            product: [
              { name: '6517R01SK1', num: [{ name: '389260' },{ name: '1974-11' },{ name: '1974-1' }, { name: '324918-7' },] }, 
              { name: '6550R01SK1', num: [{ name: '378160' },{ name: 'H-25' },   { name: '1974-9' }, { name: '1974-1' },{ name: '324918-7' },] }, 
              { name: '6550R02SK1', num: [{ name: '378160' },{ name: 'H-25' },   { name: '1974-9' }, { name: '1974-1' },{ name: '324918-7' },] }, 
              { name: '6570R01SK1', num: [{ name: '389233' },{ name: 'H-24' },   { name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: '6590R01SK1', num: [{ name: '389291' },{ name: '1973-7' }, { name: '1973-1' }, { name: 'H-22' },,{ name: '324918-12' }] }, 
              { name: '6590R02SK1', num: [{ name: '378160' },{ name: 'H-25' },   { name: '1974-9' }, { name: '1974-1' },{ name: '324918-7' },] }, 
              { name: '6590R03SK1', num: [{ name: '401789' },{ name: '1974-11' },{ name: '1974-1' }, { name: '324918-7' },] }, 
              { name: '6610R01SK1', num: [{ name: '378160' },{ name: 'H-25' },   { name: '1974-9' }, { name: '1974-1' },{ name: '324918-7' },]  }, 
              { name: '6630R01SK1', num: [{ name: '389291' },{ name: '1973-7' }, { name: '1973-1' }, { name: 'H-22' },,{ name: '324918-12' }] }, 
              { name: '6630R01SK2', num: [{ name: '378160' },{ name: 'H-25' },   { name: '1974-9' }, { name: '1974-1' },{ name: '324918-7' },] }, 
              { name: '6650R01SK1', num: [{ name: '378160' },{ name: 'H-25' },   { name: '1974-9' }, { name: '1974-1' },{ name: '324918-7' },] }, 
              { name: '6650R01SK2', num: [{ name: '367369' },{ name: '1974-11' },{ name: '1974-1' }, { name: '358799' },] }, 
              { name: '6650R02SK1', num: [{ name: '389260' },{ name: '1974-11' },{ name: '1974-1' }, { name: '324918-7' },] }, 
              { name: '6650R02SK2', num: [{ name: '367369' },{ name: '1974-11' },{ name: '1974-1' }, { name: '358799' },] }, 
              { name: '6670R01SK1', num: [{ name: '389291' },{ name: '1973-7' }, { name: '1973-1' }, { name: 'H-22' },,{ name: '324918-12' }] }, 
              { name: '6670R01SK2', num: [{ name: '378160' },{ name: 'H-25' },   { name: '1974-9' }, { name: '1974-1' },] }, 
              { name: '6815R01SK1', num: [{ name: '1973-7' },{ name: '351512' }, { name: '1973-1' }, ] }, 
            ]
          },
          //右后门
          {
            name: '右后门',
            product: [
              { name: '6507R01SK1', num: [{ name: '389260' },{ name: '1974-11' },{ name: '1974-1' }, { name: '324918-7' },] }, 
              { name: '6540R01SK1', num: [{ name: '378160' },{ name: 'H-25' },   { name: '1974-9' }, { name: '1974-1' },  { name: '324918-7' },] }, 
              { name: '6540R02SK1', num: [{ name: '378160' },{ name: 'H-25' },   { name: '1974-9' }, { name: '1974-1' },  { name: '324918-7' },] }, 
              { name: '6560R01SK1', num: [{ name: '389233' },{ name: 'H-24' },   { name: '1974-13' },{ name: '1974-1' },  { name: '324918-6' },] }, 
              { name: '6580R01SK1', num: [{ name: '378160' },{ name: 'H-25' },   { name: '1974-9' }, { name: '1974-1' },  { name: '324918-7' },] }, 
              { name: '6580R02SK1', num: [{ name: '389291' },{ name: '1973-7' }, { name: '1973-1' }, { name: 'H-22' },,{ name: '324918-12' }] }, 
              { name: '6580R03SK1', num: [{ name: '401789' },{ name: '1974-11' },{ name: '1974-1' }, { name: '324918-7' },] }, 
              { name: '6600R01SK1', num: [{ name: '378160' },{ name: 'H-25' },   { name: '1974-9' }, { name: '1974-1' },  { name: '324918-7' },] }, 
              { name: '6620R01SK1', num: [{ name: '389291' },{ name: '1973-7' }, { name: '1973-1' }, { name: 'H-22' },,{ name: '324918-12' }] }, 
              { name: '6620R01SK2', num: [{ name: '378160' },{ name: 'H-25' },   { name: '1974-9' }, { name: '1974-1' },  { name: '324918-7' },] }, 
              { name: '6640R01SK1', num: [{ name: '378160' },{ name: 'H-25' },   { name: '1974-9' }, { name: '1974-1' },  { name: '324918-7' },] }, 
              { name: '6640R02SK1', num: [{ name: '389260' },{ name: '1974-11' },{ name: '1974-1' }, { name: '324918-7' },] }, 
              { name: '6640R02SK2', num: [{ name: '367369' },{ name: '1974-11' },{ name: '1974-1' }, { name: '358799' },  ] }, 
              { name: '6660R01SK1', num: [{ name: '389291' },{ name: '1973-7' }, { name: '1973-1' }, { name: 'H-22' }, ,{ name: '324918-12' }] }, 
              { name: '6660R01SK2', num: [{ name: '378160' },{ name: 'H-25' },   { name: '1974-9' }, { name: '1974-1' },  { name: '324918-7' },] }, 
              { name: '6805R01SK1', num: [{ name: '1973-7' },{ name: '351512' }, { name: '1973-1' }, { name: '' }, ] }, 
            ]
          },
        ]
      },
      //2.2总拼
      {
        name: '2.2总拼',
        dept: [
          //总拼1
          {
            name: '总拼1',
            product: [
              { name: 'S230R01SK1', num: [{ name: '393104' }, { name: '393102' }, ] }, 
              { name: 'S230R02SK1', num: [{ name: '393104' }, { name: '393102' }, ] }, 
              { name: 'S230R03SK1', num: [{ name: '1974-13' },{ name: '333612' }, { name: '1973-7' },{ name: '1974-1' },{ name: '1973-1' },] }, 
              { name: 'S230R04SK1', num: [{ name: '1974-13' },{ name: '333612' }, { name: '1973-7' },{ name: '1974-1' },{ name: '1973-1' },] }, 
              { name: 'S230R05SK1', num: [{ name: '393104' }, { name: '393102' }, ] }, 
              { name: 'S230R06SK1', num: [{ name: '393104' }, { name: '393102' }, ] }, 
              { name: 'S230R08SK1', num: [{ name: '367369' }, { name: '1974-12' },{ name: '1974-1' },{ name: '324918-7' }, ] }, 
              { name: 'S230R09SK1', num: [{ name: '381735' }, { name: '1974-10' },{ name: '1974-1' },{ name: '324918-5' }, ] }, 
              { name: 'S230R10SK1', num: [{ name: '381735' }, { name: '1974-10' },{ name: '1974-1' },{ name: '324918-5' }, ] }, 
              { name: 'S240R03SK1', num: [{ name: '1974-12' },{ name: '1974-1' }, { name: '409265' },] }, 
              { name: 'S240R04SK1', num: [{ name: '1974-12' },{ name: '1974-1' }, { name: '409265' },] }, 
              { name: 'S250R01SK1', num: [{ name: '381735' }, { name: '1974-10' },{ name: '1974-1' },{ name: '324918-5' }, ] }, 
              { name: 'S250R02SK1', num: [{ name: '381735' }, { name: '1974-10' },{ name: '1974-1' },{ name: '324918-5' }, ] }, 
              { name: 'S250R03SK1', num: [{ name: '389266' }, { name: '1987-12' },{ name: '1974-1' },{ name: '324918-7' }, ] }, 
              { name: 'S250R04SK1', num: [{ name: '389266' }, { name: '1987-12' },{ name: '1974-1' },{ name: '324918-7' }, ] }, 
              { name: 'S260R01SK1', num: [{ name: '393145' }, { name: '1974-13' },{ name: '1974-1' }, ] }, 
              { name: 'S260R01SK2', num: [{ name: '378130' }, { name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'S260R02SK1', num: [{ name: '393145' }, { name: '1974-13' },{ name: '1974-1' }, ] }, 
              { name: 'S260R02SK2', num: [{ name: '378130' }, { name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'S260R03SK1', num: [{ name: '409298' }, { name: '409301' },  ] }, 
              { name: 'S260R04SK1', num: [{ name: '409298' }, { name: '409301' },  ] }, 
              { name: 'S270R01SK1', num: [{ name: '360063' }, { name: '1974-12' },{ name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: 'S270R02SK1', num: [{ name: '360063' }, { name: '1974-12' },{ name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: 'S270R03SK1', num: [{ name: '1973-8' }, { name: '1973-1' }, { name: '409268' },] }, 
              { name: 'S270R04SK1', num: [{ name: '1973-8' }, { name: '1973-1' }, { name: '409268' },] }, 
            ]
          },
          //总拼2
          {
            name: '总拼2',
            product: [
              { name: 'S330R01SK1', num: [{ name: '393145' },{ name: '1974-13' },{ name: '1974-1' }, ] }, 
              { name: 'S330R02SK1', num: [{ name: '393145' },{ name: '1974-13' },{ name: '1974-1' }, ] }, 
              { name: 'S330R03SK1', num: [{ name: '409295' },{ name: '393123' }, { name: 'H-23' },   ] }, 
              { name: 'S330R04SK1', num: [{ name: '409295' },{ name: '393123' }, { name: 'H-23' },   ] }, 
              { name: 'S330R05SK1', num: [{ name: '393104' },{ name: '393102' },  ] }, 
              { name: 'S330R06SK1', num: [{ name: '393104' },{ name: '393102' },  ] }, 
              { name: 'S330R07SK1', num: [{ name: '389286' },{ name: '1974-13' },{ name: '1974-1' }, ] }, 
              { name: 'S330R09SK1', num: [{ name: '395171' },{ name: '1974-12' },] }, 
              { name: 'S330R10SK1', num: [{ name: '395171' },{ name: '1974-12' },] }, 
              { name: 'S350R01SK1', num: [{ name: '360063' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: 'S350R02SK1', num: [{ name: '360063' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: 'S350R03SK1', num: [{ name: '360063' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: 'S350R04SK1', num: [{ name: '360063' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: 'S360R03SK1', num: [{ name: '395174' },{ name: '395172' }, ] }, 
              { name: 'S360R04SK1', num: [{ name: '395174' },{ name: '395172' }, ] }, 
              { name: 'S360R05SK1', num: [{ name: '360063' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: 'S360R06SK1', num: [{ name: '360063' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-6' },{ name: 'H-25' }, ] }, 
              { name: 'S360R07SK1', num: [{ name: '360063' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: 'S360R08SK1', num: [{ name: '378160' },{ name: '1974-9' }, { name: '1974-1' },] }, 
              { name: 'S360R09SK1', num: [{ name: '378167' },{ name: '1974-13' },{ name: '1974-1' },{ name: 'H-22' },{ name: '324918-6' }, ] }, 
              { name: 'S360R10SK1', num: [{ name: '378167' },{ name: '1974-13' },{ name: '1974-1' },{ name: 'H-22' },{ name: '324918-6' }, ] }, 
              { name: 'S360R11SK1', num: [{ name: '378167' },{ name: '1974-13' },{ name: '1974-1' },{ name: 'H-22' },{ name: '324918-6' }, ] }, 
              { name: 'S360R12SK1', num: [{ name: '378167' },{ name: '1974-13' },{ name: '1974-1' },{ name: 'H-22' },{ name: '324918-6' }, ] }, 
            ]
          },
          //总拼3
          {
            name: '总拼3',
            product: [
              { name: 'S410R01SK1', num: [{ name: '406385' },{ name: '1973-6' },{ name: '1973-1' }, ] }, 
              { name: 'S410R02SK1', num: [{ name: '406385' },{ name: '1973-6' },{ name: '1973-1' }, ] }, 
            ]
          },
          //总拼4
          {
            name: '总拼4',
            product: [
              { name: 'S510R01SK1', num: [{ name: '378167' },{ name: '1974-13' },{ name: '1974-1' }, { name: 'H-22' },{ name: '324918-6' },] }, 
              { name: 'S510R02SK1', num: [{ name: '378167' },{ name: '1974-13' },{ name: '1974-1' }, { name: 'H-22' },{ name: '324918-6' }, ] }, 
              { name: 'S510R05SK1', num: [{ name: '409266' },{ name: '1974-13' },{ name: '1974-1' }, ] }, 
              { name: 'S510R06SK1', num: [{ name: '378167' },{ name: '1974-13' },{ name: '1974-1' }, { name: 'H-22' },{ name: '324918-6' },] }, 
              { name: 'S520R01SK1', num: [{ name: '378191' },{ name: '378192' }, { name: 'H-23' }, ] }, 
              { name: 'S520R02SK1', num: [{ name: '378191' },{ name: '378192' }, { name: 'H-23' }, ] }, 
              { name: 'S520R05SK1', num: [{ name: '409292' },{ name: '1974-13' },{ name: '1974-1' }, ] }, 
              { name: 'S520R06SK1', num: [{ name: '409292' },{ name: '1974-13' },{ name: '1974-1' }, ] }, 
              { name: 'S540R01SK1', num: [{ name: '389286' },{ name: '1974-13' },{ name: '1974-1' }, ] }, 
              { name: 'S540R02SK1', num: [{ name: '389286' },{ name: '1974-13' },{ name: '1974-1' }, ] }, 
              { name: 'S540R03SK1', num: [{ name: '360063' },{ name: '1974-12' },{ name: '1974-1' }, { name: '324918-6' },] }, 
              { name: 'S540R04SK1', num: [{ name: '360063' },{ name: '1974-12' },{ name: '1974-1' }, { name: '324918-6' },] }, 
              { name: 'S540R05SK1', num: [{ name: '409305' },{ name: '368551' },] }, 
              { name: 'S540R06SK1', num: [{ name: '409305' },{ name: '368551' },  ] }, 
            ]
          },
          //2.2PSD
          {
            name: '2.2PSD',
            product: [
              { name: 'S110R01SK1', num: [{ name: '378167' },{ name: '1974-13' },{ name: 'H-22' },  { name: '1974-1' },{ name: '324918-6' }, ] },
              { name: 'S120R01SK1', num: [{ name: '393100' },{ name: '1974-13' },{ name: '1974-1' },{ name: 'H-21' }, ] },
             ]
          },
          //2.1PSD
          {
            name: '2.1PSD',
            product: [
              { name: '5140R01SK1', num: [{ name: '378167' },{ name: '1974-13' },{ name: 'H-22' },  { name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: '5140R02SK1', num: [{ name: '378167' },{ name: '1974-13' },{ name: 'H-22' },  { name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: '5150R01SK1', num: [{ name: '1974-9' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: '5155R01SK1', num: [{ name: '1974-9' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: '5155R02SK1', num: [{ name: '378167' },{ name: '1974-13' },{ name: 'H-22' },  { name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: 'Z130',       num: [{ name: '378167' },{ name: '1974-13' },{ name: 'H-22' },  { name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: 'Z135',       num: [{ name: '378167' },{ name: '1974-13' },{ name: 'H-22' },  { name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: 'Z150',       num: [{ name: '378167' },{ name: '1974-13' },{ name: 'H-22' },  { name: '1974-1' },{ name: '324918-6' }, ] }, 
            ]
          },
        ]
      },
      //2.2底板主线
      {
        name: '2.2底板主线',
        dept: [
          //GEO1
          {
            name: 'GEO1',
            product: [
              { name: 'E010R01SK1', num: [{ name: '374889' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-2' }, ] }, 
              { name: 'E010R02SK1', num: [{ name: '374889' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-2' }, ] }, 
              { name: 'E010R03SK1', num: [{ name: '348463' },{ name: '1974-13' },{ name: '1974-1' }, ] }, 
              { name: 'E010R04SK1', num: [{ name: '348463' },{ name: '1974-13' },{ name: '1974-1' }, ] }, 
              { name: 'E010R05SK1', num: [{ name: '374889' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-2' }, ] }, 
              { name: 'E010R06SK1', num: [{ name: '389303' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-2' }, ] }, 
            ]
          },
          //GEO2
          {
            name: 'GEO2',
            product: [
              { name: 'J020R01SK1', num: [{ name: '376523' }, { name: '1974-12' },{ name: '1974-1' },] }, 
              { name: 'J020R02SK1', num: [{ name: '376523' }, { name: '1974-12' },{ name: '1974-1' },] }, 
              { name: 'J020R03SK1', num: [{ name: '347819' }, { name: '1974-11' },{ name: '1974-1' },{ name: '324918-3' },] }, 
              { name: 'J020R04SK1', num: [{ name: '347819' }, { name: '1974-11' },{ name: '1974-1' },{ name: '324918-3' },] }, 
              { name: 'J020R05SK1', num: [{ name: '376523' }, { name: '1974-12' },{ name: '1974-1' },] }, 
              { name: 'J020R06SK1', num: [{ name: '376523' }, { name: '1974-12' },{ name: '1974-1' },] }, 
              { name: 'J005R01SK1', num: [{ name: '389233' }, { name: '1974-13' },{ name: '1974-1' },{ name: 'H-24' },{ name: '314918-6' },] }, 
              { name: 'J005R02SK1', num: [{ name: '389233' }, { name: '1974-13' },{ name: '1974-1' },{ name: 'H-24' },{ name: '314918-6' },] }, 
              { name: 'J010R01SK1', num: [{ name: '389233' }, { name: '1974-13' },{ name: '1974-1' },{ name: 'H-24' },{ name: '314918-6' },] }, 
              { name: 'J010R02SK1', num: [{ name: '389233' }, { name: '1974-13' },{ name: '1974-1' },{ name: 'H-24' },{ name: '314918-6' },] }, 
              { name: 'J011R01SK1', num: [{ name: '381735' }, { name: '1974-10' },{ name: '1974-1' },{ name: '324918-5' },] }, 
              { name: 'J075R01SK1', num: [{ name: '1974-13' },{ name: '1973-7' }, { name: '333612' },{ name: '1974-1' },{ name: '1973-1' },] }, 
              { name: 'J076R01SK1', num: [{ name: '1974-13' },{ name: '1973-7' }, { name: '333612' },{ name: '1974-1' },{ name: '1973-1' },] }, 
            ]
          },
          //UB1.1
          {
            name: 'UB1.1',
            product: [
              { name: 'E030R01SK1', num: [{ name: '1973-7' },{ name: '1973-1' },{ name: '1974-9' },{ name: '1974-1' },{ name: '324918-5' }, ] }, 
              { name: 'E030R02SK1', num: [{ name: '1973-7' },{ name: '1973-1' },{ name: '1974-9' },{ name: '1974-1' },{ name: '324918-5' }, ] }, 
              { name: 'E030R03SK1', num: [{ name: '397805' },{ name: '1974-1' },{ name: '1974-13' }, ] }, 
              { name: 'E030R04SK1', num: [{ name: '397805' },{ name: '1974-1' },{ name: '1974-13' }, ] }, 
              { name: 'E040R01SK1', num: [{ name: '376523' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'E040R02SK1', num: [{ name: '376523' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'E050R03SK1', num: [{ name: '389266' },{ name: '324918-7' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'E050R04SK1', num: [{ name: '389266' },{ name: '324918-7' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
            ]
          },
          //UB1.2
          {
            name: 'UB1.2',
            product: [
              { name: 'E110R01SK1', num: [{ name: '376523' },{ name: '1974-12' },{ name: '1974-1' },] }, 
              { name: 'E110R02SK1', num: [{ name: '376523' },{ name: '1974-12' },{ name: '1974-1' },] }, 
              { name: 'E110R03SK1', num: [{ name: '374889' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-2' }, ] }, 
              { name: 'E110R04SK1', num: [{ name: '348463' },{ name: '1974-13' },{ name: '1974-1' }, ] }, 
              { name: 'E135R01SK1', num: [{ name: '409271' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'E135R02SK1', num: [{ name: '409271' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'E140R03SK1', num: [{ name: '370903' },{ name: '370902' }, ] }, 
              { name: 'E140R04SK1', num: [{ name: '370903' },{ name: '370902' }, ] }, 
              { name: 'E150R01SK1', num: [{ name: '376523' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'E150R02SK1', num: [{ name: '374889' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-2' }, ] }, 
              { name: 'E150R03SK1', num: [{ name: '374889' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-2' }, ] }, 
              { name: 'E150R04SK1', num: [{ name: '374889' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-2' }, ] }, 
            ]
          },
          //UB2.1
          {
            name: 'UB2.1',
            product: [
              { name: 'J060R01SK1', num: [{ name: '380236' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-1' }, ] }, 
              { name: 'J060R02SK1', num: [{ name: '380236' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-1' }, ] }, 
              { name: 'J060R03SK1', num: [{ name: '374887' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'J060R04SK1', num: [{ name: '374887' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'J060R05SK1', num: [{ name: '378130' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'J060R06SK1', num: [{ name: '374887' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'J110R01SK1', num: [{ name: '381735' },{ name: '1974-10' },{ name: '1974-1' },{ name: '324918-5' }, ] }, 
              { name: 'J110R02SK1', num: [{ name: '381735' },{ name: '1974-10' },{ name: '1974-1' },{ name: '324918-5' }, ] }, 
              { name: 'J110R03SK1', num: [{ name: '389266' },{ name: '324918-7' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'J110R04SK1', num: [{ name: '389266' },{ name: '324918-7' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'J120R01SK1', num: [{ name: '378150' },{ name: '359087' },{ name: 'H-22' }, ] }, 
              { name: 'J120R02SK1', num: [{ name: '378150' },{ name: '359087' },{ name: 'H-22' }, ] }, 
              { name: 'J120R03SK1', num: [{ name: '381735' },{ name: '1974-10' },{ name: '1974-1' }, ] }, 
              { name: 'J120R04SK1', num: [{ name: '381735' },{ name: '1974-10' },{ name: '1974-1' }, ] }, 
              { name: 'J130R01SK1', num: [{ name: '1974-12' },{ name: '1974-1' },{ name: '360063' }, ] }, 
              { name: 'J130R02SK1', num: [{ name: '1974-12' },{ name: '1974-1' },{ name: '360063' }, ] }, 
              { name: 'J130R03SK1', num: [{ name: '374887' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'J130R04SK1', num: [{ name: '374887' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'J160R01SK1', num: [{ name: '374889' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-2' }, ] }, 
              { name: 'J160R02SK1', num: [{ name: '374889' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-2' }, ] }, 
              { name: 'J160R03SK1', num: [{ name: '374889' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-2' }, ] }, 
              { name: 'J160R04SK1', num: [{ name: '374889' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-2' }, ] }, 
            ]
          },
          //UB2.2
          {
            name: 'UB2.2',
            product: [
              { name: 'J200R01SK1', num: [{ name: '374889' },{ name: '1974-12' },{ name: '324918-2' },{ name: '1974-1' }, ] }, 
              { name: 'J200R02SK1', num: [{ name: '374889' },{ name: '1974-12' },{ name: '324918-2' },{ name: '1974-1' }, ] }, 
              { name: 'J200R04SK1', num: [{ name: '374889' },{ name: '1974-12' },{ name: '324918-2' },{ name: '1974-1' }, ] }, 
            ]
          },
        ]
      },
      //2.2门盖
      {
        name: '2.2门盖',
        dept: [
          //前盖
          {
            name: '前盖',
            product: [
              { name: 'W020R01SK1', num: [{ name: '378167' },{ name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' },{ name: 'H-22' }, ] }, 
              { name: 'W020R02SK1', num: [{ name: '378167' },{ name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' },{ name: 'H-22' }, ] }, 
              { name: 'W080R01SK1', num: [{ name: '378167' },{ name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' },{ name: 'H-22' }, ] }, 
              { name: 'W085R01SK1', num: [{ name: '389233' },{ name: '1974-13' },{ name: '1974-1' },{ name: 'H-24' }, ] }, 
              { name: 'W120R01SK1', num: [{ name: '1974-1' },{ name: '1974-11' }, ] }, 
            ]
          },
          //后盖
          {
            name: '后盖',
            product: [
              { name: 'W250R01SK1', num: [{ name: '393111' },{ name: '389239' },{ name: 'H-24' }, ] }, 
              { name: 'W250R02SK1', num: [{ name: '380306' },{ name: '1974-13' },{ name: '1974-1' },{ name: '333612' },{ name: 'H-23' }, ] }, 
              { name: 'W260R01SK1', num: [{ name: '380306' },{ name: '1974-13' },{ name: '1974-1' },{ name: '333612' },{ name: 'H-23' }, ] }, 
              { name: 'W260R01SK2', num: [{ name: '380306' },{ name: '1974-13' },{ name: '1974-1' },{ name: '333612' },{ name: 'H-23' }, ] }, 
              { name: 'W280R01SK1', num: [{ name: '389243' },{ name: '378206' },{ name: 'H-23' },] }, 
              { name: 'W330R01SK1', num: [{ name: '389125' },{ name: '389124' },{ name: '' }, ] }, 
              { name: 'W330R02SK1', num: [{ name: '389125' },{ name: '389124' },{ name: '' }, ] }, 
              { name: 'W340R01SK1', num: [{ name: '389125' },{ name: '389124' },{ name: '' }, ] }, 
              { name: 'W350R01SK1', num: [{ name: '367369' },{ name: '1974-11' },{ name: '1974-1' },{ name: '358799' }, ] }, 
              { name: 'W420R01SK1', num: [{ name: '1974-12' },{ name: '1974-1' },{ name: '389266' },{ name: '324918-7' }, ] }, 
              { name: 'W420R02SK1', num: [{ name: '1974-12' },{ name: '1974-1' },{ name: '389266' },{ name: '324918-7' }, ] }, 
              { name: 'W440R01SK1', num: [{ name: '1973-7' },{ name: '324918-12' },{ name: '1973-1' },{ name: '389291' },{ name: 'H-22' }, ] }, 
              { name: 'W445R01SK1', num: [{ name: '1973-7' },{ name: '324918-12' },{ name: '1973-1' },{ name: '389291' },{ name: 'H-22' }, ] }, 
            ]
          },
          //左前门
          {
            name: '左前门',
            product: [
              { name: 'T070R01SK1', num: [{ name: '367369' },{ name: '1974-11' },{ name: '1974-1' },{ name: '358799' }, ] },
              { name: 'T090R01SK1', num: [{ name: '367369' },{ name: '1974-11' },{ name: '1974-1' },{ name: '358799' }, ] },
              { name: 'T110R01SK1', num: [{ name: '354631' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-7' },] },
              { name: 'T150R01SK1', num: [{ name: '389227' },{ name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' },] },
              { name: 'T170R01SK1', num: [{ name: '1973-7' },{ name: '324918-12' },{ name: '1973-1' },{ name: '389291' },{ name: 'H-22' }, ] },
              { name: 'T190R01SK1', num: [{ name: '389239' },{ name: '389238' },{ name: 'H-24' }, ] },
              { name: 'T190R01SK2', num: [{ name: '374964' },{ name: '393097' },{ name: '324918-8' },{ name: 'H-20' }, ] },
              { name: 'T230R01SK1', num: [{ name: '393106' },{ name: '1974-10' },{ name: '1974-1' },{ name: '324918-5' }, ] },
              { name: 'T250R01SK1', num: [{ name: '389212' },{ name: '1974-10' },{ name: '1974-1' },{ name: '324918-7' }, ] },
              { name: 'T270R01SK1', num: [{ name: '374964' },{ name: '393097' },{ name: '324918-8' },{ name: 'H-20' },] },
              { name: 'T270R01SK2', num: [{ name: '1973-7' },{ name: '324918-12' },{ name: '1973-1' },{ name: '389291' },{ name: 'H-22' }, ] },
              { name: 'T300R01SK1', num: [{ name: '409263' },{ name: '1974-11' },{ name: '1974-1' }, ] },
              { name: 'T320R01SK1', num: [{ name: '389288' },{ name: '1974-9' },{ name: '1974-1' }, ] },
              { name: 'T456R01SK1', num: [{ name: '1974-1' },{ name: '1974-11' }, ] },
             ]
          },
          //右前门
          {
            name: '右前门',
            product: [
              { name: 'T060R01SK1', num: [{ name: '367369' },{ name: '1974-11' },{ name: '1974-1' },{ name: '358799' },] }, 
              { name: 'T080R01SK1', num: [{ name: '367369' },{ name: '1974-11' },{ name: '1974-1' },{ name: '358799' },] }, 
              { name: 'T100R01SK1', num: [{ name: '354631' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-7' },] }, 
              { name: 'T140R01SK1', num: [{ name: '389227' },{ name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' },] }, 
              { name: 'T160R01SK1', num: [{ name: '1973-7' },{ name: '324918-12' },{ name: '1973-1' },{ name: '389291' },{ name: 'H-22' }, ] }, 
              { name: 'T180R01SK1', num: [{ name: '374964' },{ name: '393097' },{ name: '324918-8' },{ name: 'H-20' }, ] }, 
              { name: 'T180R01SK2', num: [{ name: '389239' },{ name: '389238' },{ name: 'H-24' }, ] }, 
              { name: 'T220R01SK1', num: [{ name: '393106' },{ name: '1974-10' },{ name: '1974-1' },{ name: '324918-5' },] }, 
              { name: 'T240R01SK1', num: [{ name: '389212' },{ name: '1974-10' },{ name: '1974-1' },{ name: '324918-7' },] }, 
              { name: 'T260R01SK1', num: [{ name: '374964' },{ name: '393097' },{ name: '324918-8' },{ name: 'H-20' }, ] }, 
              { name: 'T260R01SK2', num: [{ name: '1973-7' },{ name: '324918-12' },{ name: '1973-1' },{ name: '389291' },{ name: 'H-22' }, ] }, 
              { name: 'T300R01SK1', num: [{ name: '409263' },{ name: '1974-11' },{ name: '1974-1' },] }, 
              { name: 'T320R01SK1', num: [{ name: '389288' },{ name: '1974-9' },{ name: '1974-1' }, ] }, 
              { name: 'T446R01SK1', num: [{ name: '1974-1' },{ name: '1974-11' }, ] }, 
            ]
          },
          //左后门
          {
            name: '左后门',
            product: [
              { name: 'T570R01SK1', num: [{ name: '389227' },{ name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: 'T590R01SK1', num: [{ name: '389227' },{ name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: 'T610R01SK1', num: [{ name: '389227' },{ name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: 'T650R01SK1', num: [{ name: '389227' },{ name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: 'T670R01SK1', num: [{ name: '1973-7' },{ name: '324918-12' },{ name: '1973-1' },{ name: '389291' },{ name: 'H-22' }, ] }, 
              { name: 'T690R01SK1', num: [{ name: '376523' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'T690R01SK2', num: [{ name: '374964' },{ name: '393097' },{ name: '324918-8' },{ name: 'H-20' }, ] }, 
              { name: 'T730R01SK1', num: [{ name: '367369' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-7' }, ] }, 
              { name: 'T750R01SK1', num: [{ name: '409263' },{ name: '1974-11' },{ name: '1974-1' }, ] }, 
              { name: 'T770R01SK1', num: [{ name: '1973-7' },{ name: '324918-12' },{ name: '1973-1' },{ name: '389291' },{ name: 'H-22' }, ] }, 
              { name: 'T770R01SK2', num: [{ name: '367369' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-7' },] }, 
              { name: 'T810R01SK1', num: [{ name: '409263' },{ name: '1974-11' },{ name: '1974-1' },] }, 
            ]
          },
          //右后门
          {
            name: '右后门',
            product: [
              { name: 'T560R01SK1', num: [{ name: '389227' },{ name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' },] }, 
              { name: 'T580R01SK1', num: [{ name: '389227' },{ name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' },] }, 
              { name: 'T600R01SK1', num: [{ name: '389227' },{ name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' },] }, 
              { name: 'T640R01SK1', num: [{ name: '389227' },{ name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' },] }, 
              { name: 'T660R01SK1', num: [{ name: '1973-7' },{ name: '324918-12' },{ name: '1973-1' },{ name: '389291' },{ name: 'H-22' }, ] }, 
              { name: 'T680R01SK1', num: [{ name: '376523' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'T680R01SK2', num: [{ name: '374964' },{ name: '393097' },{ name: '324918-8' },{ name: 'H-20' }, ] }, 
              { name: 'T720R01SK1', num: [{ name: '367369' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-7' }, ] }, 
              { name: 'T740R01SK1', num: [{ name: '409263' },{ name: '1974-11' },{ name: '1974-1' }, ] }, 
              { name: 'T760R01SK1', num: [{ name: '367369' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-7' }, ] }, 
              { name: 'T760R01SK2', num: [{ name: '367369' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-7' }, ] }, 
              { name: 'T800R01SK1', num: [{ name: '409263' },{ name: '1974-11' },{ name: '1974-1' }, ] }, 
            ]
          },
        ]
      },
      //2.2侧围
      {
        name: '2.2侧围',
        dept: [
          //SIH
          {
            name: 'SIH',
            product: [
              { name: 'J330R01SK1', num: [{ name: '1973-7' },{ name: '1973-1' },{ name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: 'J340R01SK1', num: [{ name: '378186' },{ name: '1973-8' },{ name: '1973-1' }, ] }, 
              { name: 'J340R02SK1', num: [{ name: '374889' },{ name: '1974-12' },{ name: '1974-1' },] }, 
              { name: 'J350R01SK1', num: [{ name: '378186' },{ name: '1973-8' },{ name: '1973-1' }, ] }, 
              { name: 'J350R02SK1', num: [{ name: '374889' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'J360R01SK1', num: [{ name: '389260' },{ name: '1974-11' },{ name: '1974-1' }, ] }, 
              { name: 'J370R01SK1', num: [{ name: '389260' },{ name: '1974-11' },{ name: '1974-1' }, ] }, 
              { name: 'J380R01SK1', num: [{ name: '389269' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'J380R02SK1', num: [{ name: '1973-7' },{ name: '1973-1' },{ name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: 'J390R01SK1', num: [{ name: '389269' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'J390R02SK1', num: [{ name: '1973-7' },{ name: '1973-1' },{ name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: 'J400R01SK1', num: [{ name: '393129' },{ name: '374889' },{ name: 'H-25' }, ] }, 
              { name: 'J410R01SK1', num: [{ name: '393129' },{ name: '374889' },{ name: 'H-25' }, ] }, 
              { name: 'J430R01SK1', num: [{ name: '1973-7' },{ name: '1973-1' },{ name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: 'J435R01SK1', num: [{ name: '374889' },{ name: '393129' },{ name: 'H-25' }, ] }, 
              { name: 'J320R01SK1', num: [{ name: '1973-7' },{ name: '1973-1' },{ name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: 'J360R01SK1', num: [{ name: '1973-7' },{ name: '1973-1' },{ name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: 'J400R01SK1', num: [{ name: '374889' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-2' }, ] }, 
              { name: 'J420R01SK1', num: [{ name: '1973-7' },{ name: '1973-1' },{ name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: 'J425R01SK1', num: [{ name: '374889' },{ name: '393129' },{ name: 'H-25' }, ] }, 
            ]
          },
          //STI
          {
            name: 'STI',
            product: [
              { name: 'J550R01SK1', num: [{ name: '1973-7' },{ name: '333612' },{ name: '1974-13' },{ name: '1973-1' },{ name: '1974-1' }, ] }, 
              { name: 'J550R02SK1', num: [{ name: '367369' },{ name: '1974-11' },{ name: '1974-1' },{ name: '358799' },] }, 
              { name: 'J550R03SK1', num: [{ name: '393079' },{ name: '393077' }, ] }, 
              { name: 'J590R01SK1', num: [{ name: '393085' },{ name: '376437' }, ] }, 
              { name: 'J610R01SK1', num: [{ name: '380327' },{ name: '380326' },{ name: 'H-24' }, ] }, 
              { name: 'J610R02SK1', num: [{ name: '380327' },{ name: '380326' },{ name: 'H-24' }, ] }, 
              { name: 'J630R01SK1', num: [{ name: '1973-7' },{ name: '333612' },{ name: '1974-13' },{ name: '1973-1' },{ name: '1974-1' }, ] }, 
              { name: 'J540R01SK1', num: [{ name: '1973-7' },{ name: '333612' },{ name: '1974-13' },{ name: '1973-1' },{ name: '1974-1' }, ] }, 
              { name: 'J540R02SK1', num: [{ name: '367369' },{ name: '1974-11' },{ name: '1974-1' },{ name: '358799' }, ] }, 
              { name: 'J540R03SK1', num: [{ name: '393079' },{ name: '393077' }, ] }, 
              { name: 'J580R01SK1', num: [{ name: '393085' },{ name: '376437' }, ] }, 
              { name: 'J600R01SK1', num: [{ name: '347819' },{ name: '1974-11' },{ name: '1974-1' },{ name: '324918-3' }, ] }, 
              { name: 'J600R02SK1', num: [{ name: '380327' },{ name: '380326' },{ name: 'H-24' },] }, 
              { name: 'J620R01SK1', num: [{ name: '1973-7' },{ name: '333612' },{ name: '1974-13' },{ name: '1973-1' },{ name: '1974-1' }, ] }, 
              { name: 'J645R01SK1', num: [{ name: '380327' },{ name: '380326' },{ name: 'H-24' }, ] }, 
              { name: 'J646R01SK1', num: [{ name: '380306' },{ name: '1974-13' },{ name: '1974-1' },{ name: 'H-23' }, ] }, 
              { name: 'J646R01SK2', num: [{ name: '389277' },{ name: '389276' }, ] }, 
              { name: 'J655R01SK1', num: [{ name: '380326' },{ name: '380327' },{ name: 'H-24' }, ] }, 
              { name: 'J656R01SK1', num: [{ name: '380306' },{ name: '1974-13' },{ name: '1974-1' },{ name: 'H-23' }, ] }, 
              { name: 'J656R01SK2', num: [{ name: '389276' },{ name: '389275' }, ] }, 
            ]
          },
          //STA
          {
            name: 'STA',
            product: [
              { name: 'N250R02SK1', num: [{ name: '389298' },{ name: '389297' },{ name: 'H-25' }, ] }, 
              { name: 'N290R01SK1', num: [{ name: '393157' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'N290R02SK1', num: [{ name: '1974-9' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'N295R01SK1', num: [{ name: '397669' },{ name: '397671' },] }, 
              { name: 'N295R01SK2', num: [{ name: '1974-9' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'N240R02SK1', num: [{ name: '392182' },{ name: '392181' }, ] }, 
              { name: 'N280R01SK1', num: [{ name: '393157' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'N280R02SK1', num: [{ name: '1974-9' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'N285R01SK1', num: [{ name: '397669' },{ name: '397671' }, ] }, 
              { name: 'N285R01SK2', num: [{ name: '1974-9' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
            ]
          },
        ]
      },
      //2.2底板分拼
      {
        name: '2.2底板分拼',
        dept: [
          //纵梁
          {
            name: '纵梁',
            product: [
              { name: 'A010R01SK1', num: [{ name: '389297' },{ name: '389298' },{ name: 'H-25' }, ] }, 
              { name: 'A050R01SK1', num: [{ name: '389264' },{ name: '393152' },{ name: 'H-24' }, ] }, 
              { name: 'A060R01SK1', num: [{ name: '389264' },{ name: '393152' },{ name: 'H-24' }, ] }, 
              { name: 'A070R01SK1', num: [{ name: '393136' },{ name: '393134' }, ] }, 
              { name: 'A080R01SK1', num: [{ name: '393136' },{ name: '393134' }, ] }, 
              { name: 'A090R01SK1', num: [{ name: '389286' },{ name: '1974-13' },{ name: '1974-1' }, ] }, 
              { name: 'A110R01SK1', num: [{ name: '380323' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'A120R01SK1', num: [{ name: '380323' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'A170R01SK1', num: [{ name: '389269' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'A180R01SK1', num: [{ name: '389269' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'A210R01SK1', num: [{ name: '389297' },{ name: '389298' },{ name: 'H-25' }, ] }, 
              { name: 'A220R01SK1', num: [{ name: '389297' },{ name: '389298' },{ name: 'H-25' }, ] }, 
              { name: 'A250R01SK1', num: [{ name: '389251' },{ name: '1974-9' },{ name: '1974-1' }, ] }, 
              { name: 'A260R01SK1', num: [{ name: '389251' },{ name: '1974-9' },{ name: '1974-1' }, ] }, 
            ]
          },
          //水箱
          {
            name: '水箱',
            product: [
              { name: 'E450R01SK1', num: [{ name: '380326' },{ name: '380327' },{ name: 'H-24' }, ] }, 
              { name: 'E460R01SK1', num: [{ name: '367369' },{ name: '1974-11' },{ name: '1974-1' },{ name: '358799' }, ] }, 
              { name: 'E480R01SK1', num: [{ name: '374889' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-2' }, ] }, 
              { name: 'E490R01SK1', num: [{ name: '378155' },{ name: '378154' }, ] }, 
              { name: 'E510R01SK1', num: [{ name: '389297' },{ name: '389298' },{ name: 'H-25' }, ] }, 
              { name: 'E520R01SK1', num: [{ name: '374889' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-2' }, ] }, 
              { name: 'E530R01SK1', num: [{ name: '374889' },{ name: '1974-1' },{ name: '1974-12' }, ] }, 
              { name: 'E540R01SK1', num: [{ name: '389251' },{ name: '1974-9' },{ name: '1974-1' }, ] }, 
              { name: 'E550R01SK1', num: [{ name: '389251' },{ name: '1974-9' },{ name: '1974-1' }, ] }, 
              { name: 'E580R01SK1', num: [{ name: '1974-12' },{ name: '1974-9' },{ name: '1974-1' }, ] }, 
              { name: 'E590R01SK1', num: [{ name: '378160' },{ name: '1974-13' },{ name: '19' }, ] }, 
              { name: 'E610R01SK1', num: [{ name: '1973-7' },{ name: '1973-1' }, ] }, 
              { name: 'E630R01SK1', num: [{ name: '1974-12' },{ name: '1974-1' },{ name: '393115' },{ name: '324918-7' }, ] }, 
              { name: 'E650R01SK1', num: [{ name: '393154' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
            ]
          },
          //后地板
          {
            name: '后地板',
            product: [
              { name: 'A770R01SK1', num: [{ name: '389251' },{ name: '1974-9' },{ name: '1974-1' },] }, 
              { name: 'A770R02SK1', num: [{ name: '389251' },{ name: '1974-9' },{ name: '1974-1' },] }, 
              { name: 'A820R01SK1', num: [{ name: '1973-7' },{ name: '1973-1' },{ name: '1974-9' },{ name: '1974-1' },{ name: '324918-5' }, ] }, 
              { name: 'A820R02SK1', num: [{ name: '1973-7' },{ name: '1973-1' },{ name: '1974-9' },{ name: '1974-1' },{ name: '324918-5' }, ] }, 
              { name: 'A830R01SK1', num: [{ name: '1974-12' },{ name: '1974-9' },{ name: '1974-1' }, ] }, 
              { name: 'A840R01SK1', num: [{ name: '393140' },{ name: '393138' },{ name: 'H-21' },] }, 
              { name: 'A850R01SK1', num: [{ name: '389286' },{ name: '1974-13' },{ name: '1974-1' }, ] }, 
              { name: 'A860R01SK1', num: [{ name: '372008' },{ name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: 'A870R01SK1', num: [{ name: '372008' },{ name: '1974-13' },{ name: '1974-1' },{ name: '324918-6' }, ] }, 
              { name: 'A880R01SK1', num: [{ name: '393154' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'A890R01SK1', num: [{ name: '393154' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'A900R01SK1', num: [{ name: '323901' },{ name: '1974-12' },{ name: '324918-1' },] }, 
              { name: 'A930R01SK1', num: [{ name: '376523' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'A950R01SK1', num: [{ name: '324918-5' },{ name: '1974-9' },{ name: '1974-1' },{ name: '1973-7' },{ name: '1973-1' }, ] }, 
              { name: 'A970R01SK1', num: [{ name: '372008' },{ name: '1974-13' },{ name: '1974-1' },] }, 
            ]
          },
          //前地板
          {
            name: '前地板',
            product: [
              { name: 'A310R01SK1', num: [{ name: '393150' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'A320R01SK1', num: [{ name: '1974-9' },{ name: '359870' },{ name: '1974-1' },{ name: 'H-23' }, ] }, 
              { name: 'A330R01SK1', num: [{ name: '1974-13' },{ name: '1974-1' },{ name: '324918-7' },{ name: '1973-7' },{ name: '1973-1' }, ] }, 
              { name: 'A330R02SK1', num: [{ name: '378160' },{ name: '1974-9' },{ name: '1974-1' },{ name: '324918-7' },{ name: 'H-25' }, ] }, 
              { name: 'A340R01SK1', num: [{ name: '380313' },{ name: '384593' },{ name: 'H-23' }, ] }, 
              { name: 'A345R01SK1', num: [{ name: '378160' },{ name: '1974-9' },{ name: '1974-1' },{ name: '324918-7' },{ name: 'H-25' }, ] }, 
              { name: 'A360R01SK1', num: [{ name: '376523' },{ name: '1974-12' },{ name: '1974-1' }, ] }, 
              { name: 'A380R01SK1', num: [{ name: '333595' },{ name: '1974-12' },{ name: '1974-1' },{ name: 'H-25' }, ] }, 
              { name: 'A380R02SK1', num: [{ name: '347819' },{ name: '1973-8' },{ name: '324918-3' },{ name: '1973-1' }, ] }, 
              { name: 'A380R03SK1', num: [{ name: '333595' },{ name: '1974-12' },{ name: '1974-1' },{ name: 'H-25' }, ] }, 
              { name: 'A390R01SK1', num: [{ name: '367369' },{ name: '1974-11' },{ name: '1974-1' },{ name: '358799' }, ] }, 
              { name: 'A400R01SK1', num: [{ name: '333595' },{ name: '1974-12' },{ name: '1974-1' },{ name: 'H-25' }, ] }, 
              { name: 'A400R02SK1', num: [{ name: '333595' },{ name: '1974-12' },{ name: '1974-1' },{ name: 'H-25' }, ] }, 
              { name: 'A410R01SK1', num: [{ name: '374889' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-2' }, ] }, 
              { name: 'A420R01SK1', num: [{ name: '374889' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-2' }, ] }, 
              { name: 'A420R02SK1', num: [{ name: '374889' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-2' }, ] }, 
              { name: 'A430R01SK1', num: [{ name: '389149' },{ name: '1974-11' },{ name: '1974-1' },{ name: 'H-25' },] }, 
              { name: 'A440R01SK1', num: [{ name: '389149' },{ name: '1974-11' },{ name: '1974-1' },{ name: 'H-25' },] }, 
              { name: 'A450R01SK1', num: [{ name: '374889' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-2' }, ] }, 
              { name: 'A460R01SK1', num: [{ name: '374889' },{ name: '1974-12' },{ name: '1974-1' },{ name: '324918-2' }, ] },
              { name: 'A470R01SK1', num: [{ name: '389230' },{ name: '1974-13' },{ name: '1974-1' },{ name: '324918-2' }, ] }, 
            ]
          },
        ]
      },
    ],
    //个数计数器
    counter: 1
  },
  //多列自定义选择器改变value的方法
  bindCustomPickerChange: function (e) {
    var customArray = this.data.customArray,
      customIndex = this.data.customIndex,
      onlyArray = this.data.onlyArray;

    console.log('picker发送选择改变，携带值为', e.detail.value);
    //此处e.detail.value为当前选择的列的下标值数组，如[0,1,0]

    console.log('picker最终选择值为：', onlyArray[0][customIndex[0]], onlyArray[1][customIndex[1]], onlyArray[2][customIndex[2]], onlyArray[3][customIndex[3]]);
    this.setData({
      customIndex: e.detail.value
    })
  },

  //多列自创选择器换列方法
  bindCustomPickerColumnChange: function (e) {
    var customArray = this.data.customArray,
      customIndex = this.data.customIndex,
      onlyArray = this.data.onlyArray;

    customIndex[e.detail.column] = e.detail.value;
    // console.log(onlyArray);

    var searchColumn = () => {
      for (var i = 0; i < customArray.length; i++) {
        var arr1 = [];
        var arr2 = [];
        var arr3 = [];
        if (i == customIndex[0]) {
          for (var j = 0; j < customArray[i].dept.length; j++) {
            arr1.push(customArray[i].dept[j].name);
            if (j == customIndex[1]) {
              for (var k = 0; k < customArray[i].dept[j].product.length; k++) {
                arr2.push(customArray[i].dept[j].product[k].name);
                if (k == customIndex[2]) {
                  for (var m = 0; m < customArray[i].dept[j].product[k].num.length; m++) {
                    arr3.push(customArray[i].dept[j].product[k].num[m].name);
                  }
                  onlyArray[3] = arr3;
                }
              }
              onlyArray[2] = arr2;
            }
          }
          onlyArray[1] = arr1;
        }
      };
    }

    switch (e.detail.column) {
      case 0:
        customIndex[1] = 0;
        customIndex[2] = 0;
        customIndex[3] = 0;
        searchColumn();
        break;
      case 1:
        customIndex[2] = 0;
        customIndex[3] = 0;
        searchColumn();
        break;
      case 2:
        customIndex[3] = 0;
        searchColumn();
        break;
    }
    this.setData({
      onlyArray: onlyArray,
      customIndex: customIndex
    });
  },

  //个数计数器加减
  add: function () {
    if (this.data.counter < 3) {
      this.data.counter++
    }
    this.setData({
      counter: this.data.counter
    })
  },
  sub: function () {
    if (this.data.counter > 0) {
      this.data.counter--
    }
    this.setData({
      counter: this.data.counter
    })
  },

  //表单提交按钮
  formSubmit: function (e) {
    var that =this,
    customIndex = that.data.customIndex,
    postData = e.detail.value,
    label1 = postData.label1,
    reason = postData.reason,
    changebody = postData.changebody;
    
wx.request({
url: 'https://www.zqzqsmile.xyz/genghuan/login',
data:{
    label1:label1,
    section:that.data.onlyArray[0][customIndex[0]],
    area:that.data.onlyArray[1][customIndex[1]],
    gun:that.data.onlyArray[2][customIndex[2]],
    model:that.data.onlyArray[3][customIndex[3]],
    counterNum:that.data.counter,
    reason:postData.reason,
    changebody:postData.changebody},
    method:'POST',
    header:{'content-type': 'application/x-www-form-urlencoded'},
    success:function(res){
      console.log(res.data);
      if (label1 != '' & reason != ''& changebody != '' & res.data.status == true) {
        wx.showToast({
          title: '提交成功！！！',
          icon: 'none', 
          duration: 2000
        })
        that.setData({
          reason:'',
          changebody:'',
        })
      } else {
        wx.showToast({
          title: '数据不能为空，提交失败！！！',
          icon: 'none',
          duration: 2000
        })
    }  
}
    })},

  //表单重置按钮
  formReset: function (e) {
    console.log('form发生了reset事件')
    this.setData({
      label1:'',
      reason:'',
      changebody:'',
    })
  },
  /**
   * 点击下拉框
   */
  bindShowMsg() {
    this.setData({
     select: !this.data.select
    })
   },
    /**
   * 已选下拉框
   */
  mySelect(e) {
    console.log(e)
    var name = e.currentTarget.dataset.name
    // console.log(name)
    this.setData({
     reason: name,
     select: false
    })

   },



  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    var data = {
      customArray: this.data.customArray,
      customIndex: this.data.customIndex,
      onlyArray: this.data.onlyArray,
    };
    for (var i = 0; i < data.customArray.length; i++) {
      data.onlyArray[0].push(data.customArray[i].name);
    }
    for (var j = 0; j < data.customArray[data.customIndex[0]].dept.length; j++) {
      data.onlyArray[1].push(data.customArray[data.customIndex[0]].dept[j].name);
    }
    for (var k = 0; k < data.customArray[data.customIndex[0]].dept[data.customIndex[1]].product.length; k++) {
      data.onlyArray[2].push(data.customArray[data.customIndex[0]].dept[data.customIndex[1]].product[k].name);
    }
    for (var m = 0; m < data.customArray[data.customIndex[0]].dept[data.customIndex[1]].product[data.customIndex[2]].num.length; m++) {
      data.onlyArray[3].push(data.customArray[data.customIndex[0]].dept[data.customIndex[1]].product[data.customIndex[2]].num[m].name)
    }
    this.setData(data);


   
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})